[
  {
    "name": "HawkWatch",
    "link": "https://devpost.com/software/hawkwatch",
    "about": "HawkWatch is an intelligent video surveillance platform that detects crime, suspicious activities and life threatening events such as fainting and choking and sends phone alerts to alert security of the issue. Our intelligent model generates time-stamped incident reports with video evidence. It has 4 main features:",
    "github": "https://github.com/Grace-Shao/Treehacks2025",
    "tools": [
      "chatgpt",
      "gemini",
      "mp4",
      "nextjs",
      "react",
      "resend",
      "supabase",
      "tensorflow",
      "typescript",
      "vlm"
    ]
  },
  {
    "name": "OmNom",
    "link": "https://devpost.com/software/omnom-hg16v3",
    "about": "OmNom is a 6ft tall robot that fetches food for you. He can navigate both outdoors and indoors. OmNom can find the front door, get in line, and even use self-order booths on your behalf.\n\nAll you have to do is go to OmNom's website, and put in your order in natural language.\n\nOmNom then autonomously traverses across campus to Late Night, navigates inside, places your order for you, and brings back your food.",
    "github": "https://github.com/NilsIrl/ActuallyAHuman/tree/main",
    "tools": [
      "arduino",
      "clip",
      "dpt",
      "fast-api",
      "google-maps-places-api",
      "jetson-nano-c++",
      "lasercutting",
      "matplot-lib-v0.dev",
      "metal",
      "next.js",
      "open-cv",
      "open-route-service",
      "openai-api",
      "python",
      "react",
      "roboclaw",
      "soldering",
      "tailwindcss",
      "typescript",
      "vercel",
      "vit",
      "vite.js",
      "websockets-api"
    ]
  },
  {
    "name": "BrailleBot: Make Every Document Accessible!",
    "link": "https://devpost.com/software/readable-ai-braille-printer",
    "about": "BrailleBot is a low-cost, innovative braille printer utilizing a 3D printer and a custom spring-loaded embossing mechanism.  Developed as a Treehacks 2025 winner, it converts standard documents – including images and Zoom transcripts – into accessible braille at a fraction of the cost of existing printers (around $15 instead of $1500). The project leverages Groq’s inference engine and Llama3 models for transcription and summarization, alongside a Python Flask backend and Marlin firmware for printing via USB serial. A live preview is provided through a Next.js frontend.",
    "github": "https://github.com/cathyzbn/braille-printer",
    "tools": [
      "cad",
      "chakra",
      "claude",
      "groq",
      "llama",
      "nextjs",
      "openai",
      "python",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "BlinkAI",
    "link": "https://devpost.com/software/blinkai",
    "about": "Blink AI detects intentional blinks, measures their duration and sequence, translates them into Morse code, converts that Morse code into text, and then sends the final text to an AI assistant to generate a response.",
    "github": "https://github.com/FuzionEcho/BlinkAI",
    "tools": [
      "css",
      "flask",
      "html",
      "mediapipe",
      "opencv",
      "python",
      "react"
    ]
  },
  {
    "name": "Iris",
    "link": "https://devpost.com/software/iris-vlnzp0",
    "about": "Iris is a headset designed to assist blind and visually impaired individuals by providing real-time guidance. Developed during a hackathon, it utilizes an iPhone camera and AI agents—including captioning, image segmentation, and depth estimation—to detect hazards like wet floors or potholes within 100 milliseconds.  Upon hazard detection, Iris delivers immediate haptic alerts and step-by-step spoken instructions through TTS. Built using Expo for Android and iOS compatibility, the system employs techniques like aggressive PyTorch compiler optimization and model quantization to achieve low latency and high network throughput, leveraging Groq LPU APIs for real-time scene understanding and hazard detection.",
    "github": "https://github.com/RoyceAroc/iris",
    "tools": [
      "cuda",
      "expo.io",
      "groq",
      "nvidia",
      "python",
      "pytorch"
    ]
  },
  {
    "name": "PUSHPA - Pyro UAV System for High-risk Patrol and Alerting",
    "link": "https://devpost.com/software/pushpa-pyro-uav-system-for-high-risk-patrol-and-alerting",
    "about": "PUSHPA (Predictive UAV and Smart Headset for Proactive Assistance) is a multi-component system that integrates autonomous drones, wearable edge computing (via Meta Glasses), and an AI agentic layer (LangChain):",
    "github": "https://github.com/chandrasuda/nextgen-firewatcher",
    "tools": [
      "executorch",
      "gemini",
      "langchain",
      "llama.cpp",
      "pytorch",
      "vercel"
    ]
  },
  {
    "name": "MediLedger",
    "link": "https://devpost.com/software/mediledger",
    "about": "MediLedger is all about collaboration: providing a decentralized platform on which hospitals can more securely and confidently transmit sensitive data. Our system enables hospitals to securely check drug availability at other hospitals without exposing full inventory details on both ends.\n\nInstead of storing a simple list of drugs, each hospital stores its own inventory in a Merkle tree, where each leaf node contains a cryptographic hash of a drug name and quantity. The Merkle root (a compact summary of the entire inventory) is then submitted to EigenDA, a decentralized data availability layer. EigenDA allows hospitals to store inventory commitments on-chain without revealing individual stock details and ensures data integrity—any change in inventory changes the Merkle root, which prevents tampering.\n\nWhen a hospital needs a drug, the AI agent first checks the local hospital’s inventory. If the drug is out of stock or the supply is trending low, the AI agent fetches Merkle roots of nearby hospitals from EigenDA using Zero-Knowledge Proofs (zkProof) and the provided Merkle trees. The hospitals that have the requested drug generate a Merkle proof, which extracts the leaf node (hashed drug and quantity) from the Merkle tree, includes all necessary sibling hashes to allow recomputation of the Merkle root, and ensures the proof matches the stored Merkle root on EigenDA. The system then outputs a list of hospitals whose Merkle proofs have been validated, thus proving they have the drug in stock.",
    "github": "https://github.com/shayaansultan/treehacks-final",
    "tools": [
      "data",
      "eigenda",
      "express.js",
      "flutterflow",
      "merkle-proofs",
      "merkle-trees",
      "node.js",
      "sha256",
      "typescript",
      "web3"
    ]
  },
  {
    "name": "AgentZero",
    "link": "https://devpost.com/software/agentzero",
    "about": "Our system consists of two specialized machine learning models:",
    "github": "https://github.com/2pir2/TreeHack2025",
    "tools": [
      "eigenlayer",
      "gnark",
      "go",
      "python"
    ]
  },
  {
    "name": "ECGo",
    "link": "https://devpost.com/software/ecgo",
    "about": "ECGo takes a three second sample of your heartbeat using attached electrodes. It then forwards this sample to a remotely hosted database, from which an AI model is able to run an arrhythmia diagnosis on the test data. This information is then sent back to the user, along with a sample ID they can use to access their data in the future from our web application.",
    "github": "https://github.com/fightingj305/ecgo",
    "tools": [
      "c",
      "esp32",
      "influxdb",
      "opacity",
      "python",
      "pytorch",
      "streamlit"
    ]
  },
  {
    "name": "Therms - Thermoregulation Wearables with AI-powered Insights",
    "link": "https://devpost.com/software/therms-thermoregulation-wearables-with-ai-powered-insights",
    "about": "Therms is a wearable thermoregulation device designed to actively regulate body temperature by targeting the glabrous skin on the soles of the feet. Therms uses thermoelectric Peltier modules to provide rapid, reversible heating and cooling. Our design uses a reversed-polarity model to switch the system between heating and cooling states. An embedded sensor continuously monitors foot temperature, ensuring the system responds in real time to thermal needs. AI-powered analyses of temperature data alongside health metrics (e.g., activity levels, medical conditions) help predict and preemptively adjust stimuli responses, optimizing comfort and performance. Therms also connects to APIs (Terra, Scrapybara, OpenAI) to incorporate additional physiological data, such as heart rate, sleep patterns, and chronic conditions. This enables personalized thermoregulation strategies and early detection of anomalies. For example, if a diabetic user’s foot temperature rises abnormally, Therms can cool the area to prevent tissue damage and AUTOMATICALLY book an appointment with a healthcare professional.\n\nTherms has medical applications, supporting individuals with thermoregulation dysfunction, such as those with spinal cord injuries, diabetes, or neurodegenerative disorders, by stabilizing foot temperature and preventing complications. Therms is also focused on performance-based applications to enhance recovery and endurance by optimizing thermal regulation during and after intense activity (soldiers, athletes, manual laborers). Finally, Therms has immense geriatric applications by protecting elderly users, who are particularly vulnerable to hypothermia and hyperthermia, with preemptive adjustments based on real-time data.\n\nOverall, Therms combines advanced thermoelectric technology with a deep understanding of human physiology to create a wearable system that actively supports thermal homeostasis. By targeting the glabrous skin on the feet, Therms achieves efficient, non-invasive thermoregulation while integrating AI-powered insights to improve health outcomes and performance.",
    "github": "https://github.com/arnavnc/therms-platform",
    "tools": [
      "firebase",
      "nextjs",
      "node.js",
      "openai",
      "scrapybara",
      "tailwindcss",
      "terraapi"
    ]
  },
  {
    "name": "Project AVIA",
    "link": "https://devpost.com/software/project-avia-autonomous-vigilance-insights-for-aviation",
    "about": "Project AVIA is an AI-driven command center that consolidates real-time biometric data—heart rate, heart rate variability, oxygen saturation (SpO2), sleep quality, stress levels, exercise, and estimated blood pressure—sourced from Terra API and PPG recordings. Our command center has comprehensive insights into a pilot’s health and performance, enabling leadership to make informed, data-driven decisions.\n\nWe offer insights during:",
    "github": "https://github.com/Harsh-Karia/TreeHacks",
    "tools": [
      "cors",
      "express.js",
      "flask",
      "mistral",
      "ngrok",
      "python",
      "react",
      "tailwind",
      "terra",
      "vercel"
    ]
  },
  {
    "name": "VisionGuard: smart vision for smarter driving",
    "link": "https://devpost.com/software/visionguard-smart-vision-for-smarter-driving",
    "about": "VisionGuard leverages cutting-edge Vision-Language Models (VLMs) to analyze in-car video footage, transcribing and interpreting driver behavior with high precision. By detecting both safe and unsafe actions, VisionGuard generates actionable insights to encourage safer driving practices.\n\nOur system identifies critical situations such as:\n✅ Distracted driving (e.g., phone use, drowsiness).\n✅ Reckless maneuvers (e.g., sudden lane changes, aggressive driving).\n✅ Hazardous environmental conditions (e.g., low visibility, icy roads).\n\nWhile we aimed for real-time inference, we found that current VLM models are too computationally expensive for low-latency performance. However, through optimizations, we significantly improved processing efficiency and benchmark accuracy, making this approach feasible for future deployment.\n\nBeyond individual drivers, VisionGuard’s insights can benefit:",
    "github": "https://github.com/JayYeung/tesla_kaggle",
    "tools": [
      "apis",
      "colab",
      "gpt",
      "python",
      "reinforcement",
      "vscode"
    ]
  },
  {
    "name": "HiveMind",
    "link": "https://devpost.com/software/hivemind-18cula",
    "about": "HiveMind is an AI-powered educational platform that enhances student learning through continuous collective growth through peer learning sessions. By seamlessly integrating with online learning environments, the platform analyzes student responses and categorizes them into different levels of understanding. This classification enables the system to provide tailored support, ensuring that students who need extra help receive it, while those who have mastered concepts can reinforce their knowledge by guiding others.\n\nThe platform assesses student performance through AI-driven quizzes and assignments, determining their comprehension levels. Based on this analysis, students are placed into one of four learning hubs: those requiring foundational support, those needing additional clarification, those who have a strong grasp of concepts, and those who have achieved mastery. This hub is made up of a right balance of 4 students and this matching is done by the custom algorithm. The system then facilitates peer matching, allowing students with higher scores to assist those in lower scores. Additionally, Its seamless integration with existing learning platforms ensures that students receive real-time feedback and targeted support without disrupting their educational workflow.",
    "github": "https://github.com/rajashekarcs2023/HiveMind",
    "tools": [
      "api",
      "chromadb",
      "flask",
      "gemini",
      "intersystems",
      "nextjs",
      "perplexity",
      "python",
      "sonar",
      "streamlit",
      "superbase",
      "three.js",
      "typescript",
      "vector-embedding",
      "vespa",
      "zoom"
    ]
  },
  {
    "name": "ERWIN: Enhanced Rock Weathering Impact Navigator",
    "link": "https://devpost.com/software/erwin-enhanced-rock-weathering-impact-navigator",
    "about": "We’ve developed a visual platform democratizing ERW carbon removal assessment for any user, focusing on carbon credit markets and ERW researchers.\n\nNow, users can select a target region for an ERW project and input simple parameters of feedstock (rock) type project area, feedstock surface density, and time series length for the output. After clicking ‘Run’, the user is presented with graphs of the CO2 removal rate per meter squared, and the pH, over time in years. The user is also presented with an estimate of the total CO2 removed over the total project area over the inputted period of years.\n\nAccommodating our two main categories of stakeholders, we have a ‘Basic’ and ‘Advanced’ mode on the User Interface. Those less familiar with the science of ERW, such as potential investors, can choose the Basic mode to be provided with the simple data needed to observe Carbon Removal rates in selected regions. For those who are better-versed in ERW, the Advanced mode serves to provide more options and detailed information regarding the science of ERW and our calculations.",
    "github": "https://github.com/Jackal-Studios/rock-thing",
    "tools": [
      "beautifulsoup4",
      "crunchflow",
      "docker",
      "flask-(python)",
      "javascript",
      "mapbox-api",
      "open-meteo",
      "qiskit-(python)",
      "selenium",
      "soilgrid-api"
    ]
  },
  {
    "name": "BAS Climate Action Matcher",
    "link": "https://devpost.com/software/bas-climate-action-matcher",
    "about": "Our tool matches companies to relevant climate initiatives. We provide an agentic system with tools like RAG embedding search on a custom database of company sustainability reports, and UN-cataloged Cooperative Climate Initiatives, web scraping on websites like https://zerotracker.net/ and https://nzdpu.com/home, and more to discover corporate climate actions.",
    "github": "https://github.com/Suzehva/bas_labs",
    "tools": [
      "dain",
      "gemini",
      "google",
      "intersystems-db",
      "langchain",
      "nvidia-llama"
    ]
  },
  {
    "name": "Lemon",
    "link": "https://devpost.com/software/lemon-7gn5hq",
    "about": "To solve this problem, we built Lemon. 🍋🌱 Lemon is an app that connects farmers, businesses and individual customers to reduce food waste and fight climate change. By signing up as a customer, you can access discounted, surplus produce from local farmers that would otherwise go to waste. Lemon offers a fully transparent shopping experience; each product is listed with details about its source, and the user has full control over when and what products they buy, like traditional online grocery stores. Producers (farmers) can create listings for their surplus or \"wonky\" produce, allowing them to sell items that are perfectly good but not deemed aesthetically pleasing enough for traditional markets. Businesses can also shop for discounted produce like customers, but Lemon offers business accounts additional support by enabling them to request in bulk, advertise to nearby users and and form long-term partnerships with local farmers. Lemon’s goal is to raise awareness about the impact of food waste, making it easier for everyone to make sustainable shopping choices and contribute to a greener, more connected world.\n\nPainpoints ❓Many consumers want to make sustainable choices but don’t know how. Lemon makes it easy by offering access to eco-friendly food at discounted prices. 🍏 Farmers with surplus & 'imperfect' produce get to sell their produce, creating a new source of income and increasing their positive impact on the environment. 👉 Businesses get to access locally-produced crops at much lower prices, search for and partner with producers and benefit from advertising perks, like sustainability spotlights on the app's main page that are shown to customers in their area.\n\nBroader context Lemon’s focus on reducing food waste aligns with environmental regulations. The U.S. government has set a goal to cut food waste in half by 2030 through various initiatives and consumer education. Some states are even passing legislation to restrict the amount of food waste going to landfills. Lemon has strong word-of-mouth potential, driven by eco-conscious consumers as well as farmers who are profiting out of Lemon. We also incorporated share buttons in the app so that users can share information about this initiative with their friends.\n\nMarket & Impact With 60 million tons of wasted produce every year in the U.S., the opportunity for a sustainable solution is enormous. The demand for eco-friendly food options is growing rapidly.\n\nStakeholder Incentives Farmers: sell produce that would otherwise go to waste; a new source of income. Customers: get fresh, discounted produce; contribute to sustainability. Businesses: get fresh, discounted produce in bulk; get recognition for sustainability efforts.",
    "github": "https://github.com/twosodium/lemon",
    "tools": [
      "dart",
      "flutter",
      "supabase"
    ]
  },
  {
    "name": "WiiWork",
    "link": "https://devpost.com/software/wiiwork-8u1x62",
    "about": "This project provides a minimal React template utilizing Vite, TypeScript, and ESLint for rapid development. It leverages Vite’s React plugin with either Babel or SWC for Fast Refresh. The template focuses on setting up a type-aware ESLint configuration using `tseslint` to enforce TypeScript best practices. Key steps include configuring `parserOptions` with the project’s TypeScript configuration files and updating `tseslint` to a type-checked variant, alongside integrating the `eslint-plugin-react` for React-specific rules.",
    "github": "https://github.com/Alezander9/WiiWork",
    "tools": [
      "anthropic",
      "convex",
      "deepseek",
      "elevenlabs",
      "framer-motion",
      "nvidia",
      "openai",
      "porkbun",
      "react",
      "shadcn",
      "tailwind",
      "typescript",
      "vercel",
      "whisper",
      "zustand"
    ]
  },
  {
    "name": "Portable Braille",
    "link": "https://devpost.com/software/portable-braille-cdq8v5",
    "about": "PortableBraille is an educational device designed to help young visually impaired individuals learn and practice Braille, ultimately boosting their literacy and employment prospects. The project involves a phased approach: collecting component data, creating schematics, and testing firmware. It progresses through detailed design stages – sketches, 3D modeling, and 3D printing of both the device and its enclosure.  Finally, assembly, firmware refinement, and user testing complete the development process, iterating on the design as needed.",
    "github": "https://github.com/Adil-Jussupov/PortableBraille",
    "tools": [
      "arduino",
      "bluetooth",
      "braille",
      "c",
      "esp32",
      "ios",
      "rayban|meta"
    ]
  },
  {
    "name": "HorizonX",
    "link": "https://devpost.com/software/horizonx",
    "about": "HorizonX is a two-part ecosystem:\n\nFor User - Mobile App for Visually Impaired Users:",
    "github": "https://github.com/bsflll/treehack2025",
    "tools": [
      "docker",
      "javascript",
      "nextjs",
      "python",
      "pytorch",
      "react",
      "webgpu"
    ]
  },
  {
    "name": "WingNote",
    "link": "https://devpost.com/software/wingnote",
    "about": "WingNote is a smart badge & AI-powered software system that automates clinical documentation for nurses and improves patient understanding.",
    "github": "https://github.com/bencullenn/wing-note",
    "tools": [
      "arduino-nano",
      "deepgram",
      "gemini",
      "li-po-battery",
      "mistral-ai",
      "next.js",
      "openai",
      "perplexity-api",
      "python",
      "rfid-reader",
      "supabase",
      "typescript",
      "vercel",
      "vercel-v0",
      "xiao-esp32"
    ]
  },
  {
    "name": "Lumora",
    "link": "https://devpost.com/software/lumora",
    "about": "Lumora is an AI-powered collaboration hub built within 36 hours, transforming Zoom meetings and chats into automated workflows. Leveraging Zoom APIs, Groq, Perplexity, and other tools, it offers a dynamic marketplace with 7 initial specialized tools across education, productivity, and social media. Key features include real-time workflow automation, a customizable workspace, and an interactive dashboard for task tracking. Lumora’s modular architecture supports community-created tools and future expansion, aiming to revolutionize productivity across various industries with its open-source MIT License.",
    "github": "https://github.com/ShaneYokota72/Lumora",
    "tools": [
      "groq",
      "next.js",
      "perplexity-api",
      "supabase",
      "tailwindcss",
      "typescript",
      "v0.dev",
      "zoom-api"
    ]
  },
  {
    "name": "Noteworthy: Visualize, Capture, Remember.",
    "link": "https://devpost.com/software/noteworthy-visualize-capture-remember",
    "about": "Stanford-Tree-Hacks-NoteWorthy is a real-time transcription application designed to generate illustrations and diagrams synchronized with spoken audio over a video feed. Users can create notes directly from these visuals. The project integrates with AI APIs like perplexity, OpenAI, and Gemini, allowing for advanced note-taking and potentially, further analysis of the transcribed content. It’s a tool for dynamic, visual transcription and note creation.",
    "github": "https://github.com/arushisharmaa/stanford-tree-hacks-",
    "tools": [
      "bash",
      "gemini",
      "html/css",
      "javascript",
      "ngrok",
      "node.js",
      "openai",
      "p5.js",
      "perplexity",
      "playwrightapi",
      "postman",
      "python",
      "react",
      "zoomapi"
    ]
  },
  {
    "name": "FlowPilot: Your Agentic Co-Pilot",
    "link": "https://devpost.com/software/flowpilot-zoom-agent-that-automates-your-workflows",
    "about": "FlowPilot transforms Zoom meetings into an autonomous productivity engine. By leveraging DAIN's advanced agent framework, our system:",
    "github": "https://github.com/cyu60/dain-agent",
    "tools": [
      "dain",
      "docker",
      "express.js",
      "node.js",
      "rtms",
      "websockets",
      "zoom"
    ]
  },
  {
    "name": "ZoneOut",
    "link": "https://devpost.com/software/zoneout-atz5pe",
    "about": "ZoneOut utilizes textual, visual & audio contexts from meetings, enabling our AI assistant to teach, revise & explain any concept, In-Depth & in Real-Time, to users to maintain higher levels of retention, productivity & engagement.",
    "github": "https://github.com/NxtGenLegend/TreeHacks",
    "tools": [
      "chromadb",
      "colpali",
      "openai",
      "rtms",
      "vlm",
      "zoom-api"
    ]
  },
  {
    "name": "WatchDog AI",
    "link": "https://devpost.com/software/watchdog-ai",
    "about": "WatchDog AI in its essence is a memecoin anti-rugger, solving the problem by removing the financial incentives. The AI agent is designed to sit on top of a potential AVS, obtaining information from 1) DEX to analyse the riskiness and the possibility of rugs, 2) mempools for transactions and 3) operates as an MEV trading bot.\n\n1) Memecoin evaluator The AI agent itself possesses the ability to evaluate the potential of future rugs based on past transactions and other data about the memecoin. It provides an evaluation on a risk scale. If the memecoin is deemed to be \"risky\" WatchDog AI would start listening to the mempool for potential malicious rugs.\n\n2) Mempool listener WatchDog taps into the mempools of coins to identify suspicious transactions in real time. It could be able to detect rug attempts and react instantly by sacrificing gas fees to frontrun the rug attempt.\n\n3) MEV attack Autotrader Identifying the rug attempt (for instance a large sell off), the agent could decide to frontrun the transaction with a large short and buy back after the the rug attempt has taken place. (Or even worse, find a way to obtain a flash loan to create a further leverage on the trade. ) This would greatly reduce the monetary gains of rugger. Else if the rugger attempts to remove liquidity, the bot could remove liquidity ahead of the rugger such that there are insufficient liquidity for the rugger to remove resulting in their loss before adding liquidity back into the pool.",
    "github": "https://github.com/BdNWoG/watchdog-ai-final",
    "tools": [
      "python",
      "solidity",
      "typescript"
    ]
  },
  {
    "name": "Cipher Shield",
    "link": "https://devpost.com/software/cipher-shield",
    "about": "Cipher Shield acts as a trusted third party, providing completely secure data aggregation services via the blockchain. We empower companies to extract aggregate statistical insights from homomorphically encrypted data, thus making it impossible to profile individuals based on their protected data.",
    "github": "https://github.com/zoraizmohammad/treehacks-2025",
    "tools": [
      "c++",
      "node.js",
      "openfhe",
      "react",
      "solidity"
    ]
  },
  {
    "name": "The Giving Tree",
    "link": "https://devpost.com/software/the-giving-tree-x0a5hk",
    "about": "The Giving Tree is the most efficient and intelligent charitable donation portfolio manager. It takes the user’s mission statement (topics that they are passionate about) and creates their category portfolio. With live RSS feeds from news websites, our app tracks every article that it deems relevant to charity. It then sorts these articles into categories of impact. With these articles, we find charities that we could donate to and update our user’s charitable donation portfolio in real time to ensure that the user is making the most efficient and intelligent donations.",
    "github": "https://github.com/emilyjsun/treehacks25/tree/main",
    "tools": [
      "beautiful-soup",
      "chroma",
      "chromadb",
      "flutter",
      "openai",
      "perplexity",
      "postgresql",
      "python",
      "rss",
      "web3"
    ]
  },
  {
    "name": "Moods and Metrics",
    "link": "https://devpost.com/software/moodmap-ai",
    "about": "Mood and Metrics offers three analysis modalities:",
    "github": "https://github.com/corey-shen/stress-level-audio-analysis",
    "tools": [
      "d3.js",
      "fastapi",
      "gemini",
      "huggingface",
      "python",
      "pytorch",
      "react",
      "tailwind",
      "three.js"
    ]
  },
  {
    "name": "Vigilante",
    "link": "https://devpost.com/software/vigilante-xkf7s9",
    "about": "Vigilante provides users with a real-time fact-checking workflow that allows them to effortlessly identify potential misinformation. The user’s entire Twitter feed is anonymously ingested and, using agentic AI workflows, verifies in real-time every single post. Posts are stripped of evocative or emotional language and are broken down into their individual claims; these claims are then verified using Perplexity's Sonar API to ground our analysis in up-to-date sources.\n\nWe do not flag every tweet you see as misinformation—rather, we carefully filter out opinions from statements, satire from misinformation. We also highlight when posts (and even specific claims) are, in fact, accurate and supported by evidence.\n\nUsing Vigilante, in addition to staying informed through your feed, you also help contribute to a crowdsourced database of tweets, their metadata, and analyses. This data lives on a dashboard that visualizes ongoing trends in misinformation on social media using data science and NLP techniques. This publicly available dashboard provides its audience with insights into what topics to be wary of online, all the while helping to tune your media literacy and stay on top of misinformation.",
    "github": "https://github.com/dav1dbai/Vigilante",
    "tools": [
      "d3.js",
      "fastapi",
      "groq",
      "next",
      "perplexity",
      "plasmo",
      "postgresql",
      "python",
      "react",
      "supabase"
    ]
  },
  {
    "name": "Superclassroom",
    "link": "https://devpost.com/software/superclassroom",
    "about": "Superclassroom is a student-adaptive exam preparation and learning material generation tool designed to adapt to each student's needs. Students using the platform will upload course material relevant to their upcoming exam or topics that they want to study, establishing a personalized knowledgebase for each course the student is taking.\n\nSuperclassroom then uses this information in a RAG pipeline to generate highly-relevant course study material, such as comprehensive notes, topic summaries, adaptive flashcards, and practice exams.\n\nThere is also a space to leave notes about the student's profile, which is used in the RAG pipeline to generate more personalized results and accommodate disability.",
    "github": "https://github.com/airjlee/superclassroom",
    "tools": [
      "intersystems",
      "iris",
      "mistral",
      "rag",
      "vectors"
    ]
  },
  {
    "name": "Verify",
    "link": "https://devpost.com/software/factchex",
    "about": "Verify is a Chrome web extension that can analyze a tweet with just a click of a button, presenting an unbiased assessment of the post's subject matter, while citing key sources and presenting an accuracy score. Although intended primarily for political awareness, the tool can be used to assess the accuracy of any tweet, from debunking false sports trades to fact-checking history fun facts. We were motivated to add this on X specifically, as the platform only has community notes as a check against misinformation, which is not available on most tweets.",
    "github": "https://github.com/jcub-gold/TreeHacks_25_Project",
    "tools": [
      "css",
      "html",
      "javascript",
      "json",
      "perplexity"
    ]
  },
  {
    "name": "SynapseAI",
    "link": "https://devpost.com/software/synapseai",
    "about": "SynapseAI transforms brain waves and biometric data into vivid visual representations in real time, enabling non-verbal communication and emotional expression for veterans with PTSD, TBI, or aphasia. Here's how it works:\n\nPre-Flow:\n\nVeterans are equipped with a Muse EEG headband and a Terra-enabled wearable that sends stress level data. Brainwave patterns and biometric data are captured and transformed into embeddings using machine learning. These embeddings are stored in a vector database as \"thought categories.\"\n\nUser Flow:\n\nIn real time, SynapseAI captures brainwave activity and stress levels. The system uses cosine similarity to match current brainwave patterns with stored embeddings. Based on the match, a multi-agent AI system (LangChain) expands, refines, and synthesizes a prompt, generating a video via Luma AI, dynamically modulated by the user’s stress levels.\n\nThe result? Veterans can express thoughts and emotions visually, enabling communication and emotional regulation even under high stress.",
    "github": "https://github.com/angad-the-coder/synapse",
    "tools": [
      "chromadb",
      "google-cloud",
      "langchain",
      "luma-ai",
      "muse-sdk",
      "numpy",
      "openai-api",
      "pandas",
      "python",
      "pytorch",
      "scipy",
      "tensorflow",
      "terra-api",
      "typescript",
      "vue.js"
    ]
  },
  {
    "name": "Conductor AI",
    "link": "https://devpost.com/software/conductor-ai",
    "about": "This project aims to intelligently route user queries to the most appropriate agent, mirroring social media recommendation systems. It utilizes a pre-trained embedding model to convert queries into vectors, then clusters similar queries.  A representative query or a cluster embedding is selected. This embedding is then mapped to an agent space to determine the optimal agent for routing, improving efficiency and accuracy as the number of agents increases.",
    "github": "https://github.com/shloknatarajan/ariadne-routing",
    "tools": [
      "agents",
      "ai-agents",
      "contrastive-learning",
      "knn",
      "python",
      "pytorch",
      "recommendation-systems"
    ]
  },
  {
    "name": "CodeInsight",
    "link": "https://devpost.com/software/code-insight",
    "about": "CodeInsight is an interactive tool that analyzes a codebase to generate a dynamic visualization of function dependencies. It extracts function definitions and their call relationships from a selected repository and displays them as an interactive network graph. Users can click on a node to view the corresponding source code in a draggable, resizable panel, with animated arrows that show the direct call flow—both outgoing (caller to callee) and incoming (callee from caller). In addition, CodeInsight integrates a chatbot powered by an AI model to answer questions about the codebase, helping developers quickly gain an understanding of complex systems.",
    "github": "https://github.com/evanng07/ej-treehacks",
    "tools": [
      "flask",
      "groq",
      "html",
      "javascript",
      "mistral",
      "perplexity",
      "python"
    ]
  },
  {
    "name": "Swarm AI",
    "link": "https://devpost.com/software/swarm-ai-s6lhd0",
    "about": "This project builds a scalable voice call platform leveraging OpenAI’s GPT-4 for AI-powered conversations, Twilio for telephony, and Supabase for data management. It supports configurable AI behaviors like accent and industry, batch calling, and real-time transcription with detailed conversation analysis. The platform utilizes WebSocket integration for audio streaming and provides metrics on call quality, latency, and token usage. Users can set up environment variables for OpenAI, Twilio, and Supabase access. Installation involves cloning the repository, installing dependencies, and configuring environment variables. The platform offers batch call support and transcript retrieval, enabling comprehensive testing and analysis of AI conversations.",
    "github": "https://github.com/phombal/swarm-backend-new",
    "tools": [
      "fastapi",
      "javascript",
      "next.js",
      "openai",
      "python",
      "render",
      "supabase",
      "vercel"
    ]
  },
  {
    "name": "PULSE.AI",
    "link": "https://devpost.com/software/pulse-ai-0oafm5",
    "about": "PulseAI captures browser context (screenshots, URLs, and titles), performs extra searches for adjacent topics via Perplexity, and stores & retrieves semantically relevant data using ChromaDB and Retrieval Augmented Generation (RAG) to bolster AI-assisted coding on Codeium's Windsurf-Cascade editor. We have two main workflows, a Passive Workflow for building up the browser context vector embedding ChromaDB and an Active Workflow for handling real-time user queries to the AI Code Editor.",
    "github": "https://github.com/ekang7/PulseAI",
    "tools": [
      "cascade",
      "chroma",
      "codeium",
      "css3",
      "fastapi",
      "html5",
      "javascript",
      "mistral",
      "mpc",
      "perplexity",
      "python",
      "rag",
      "react",
      "sonar",
      "structuredoutputs",
      "windsurf"
    ]
  },
  {
    "name": "traider",
    "link": "https://devpost.com/software/traider",
    "about": "traider is an educational platform that provides beginner investors with mock trading simulations and instantaneous AI-powered feedback for their trades. Scraping REAL historical and current stock data from Yahoo Finance, traders can engage with accurate market data and place their trades over a user-specified simulation duration beginning at a specified start date. Unlike models trained on outdated datasets, our product offers real, relevant market and economic data based on the stock ticker and current date in the simulation, which we then synthesize with NVIDIA to supplement young traders with more robust information to fuel their financial decision-making. This allows users to make informed trades using accurate and up-to-date market information.\n\nOur product stands out from other trading simulations in that it allows students to pick any timeframe in the past to put their trading skills to the test. Further, our supplemental market events information provides a more detailed painting of the financial landscape during the simulation, encouraging informed investing. Our dynamic and colorful data insights allow students to examine takeaways, while our AI-powered feedback for each executed trade promotes healthy learning and detailed mistake analysis. The leaderboard and financial calculator features offer a social and educational playground for students to explore the world of trading while gamifying finance like never before.",
    "github": "https://github.com/ajagtapdev/traider",
    "tools": [
      "fast-api",
      "figma",
      "google-search-api",
      "nvidia",
      "openai",
      "perplexity",
      "v0",
      "vercel"
    ]
  },
  {
    "name": "TheraMind",
    "link": "https://devpost.com/software/theramind",
    "about": "Treehack Warriors is a cooperative, turn-based strategy game where players control unique tree spirits battling against invading forces. The project aims to build a compelling and strategic gameplay experience with diverse character abilities and tactical combat. It’s a solo project focused on developing core mechanics and a compelling theme, utilizing a simple 2D art style. The project’s ultimate goal is to create a fun and engaging game.",
    "github": "https://github.com/cherylwu834/treehacks25",
    "tools": [
      "dain",
      "python",
      "scrapybara",
      "typescript"
    ]
  },
  {
    "name": "Agent Ricky",
    "link": "https://devpost.com/software/jarvis-mhfy78",
    "about": "Agent Ricky is a custom AI agent tailor-made for first responders and military personnel to monitor the status, safety, and health of soldiers, squadrons, and first responders in training and in action. It is essentially another member of the team.\n\nLive biometric and geolocation data collection enables Agent Ricky to detect abnormalities and dangers in real time by providing data for a series of health metrics. These health metrics are then utilized by a custom DAIN-driven AI agent to provide timely alerts, statistics, and information that could prove to be the key to save many lives.",
    "github": "https://github.com/nipunbatra8/healthbot",
    "tools": [
      "brev.dev",
      "dain",
      "python",
      "tensorflow",
      "terraapi",
      "typescript"
    ]
  },
  {
    "name": "Motherly.ai",
    "link": "https://devpost.com/software/ai-mama",
    "about": "Stress management is deeply personal - what works for one person might not work for another. That’s why we built Motherly.ai, an AI-powered agent that understands how you experience stress and takes real-world actions to support you. Using biometric data like EMG, heart rate, and blood pressure, it detects your mental state in real-time and responds with personalized interventions, whether it’s scheduling a break, ordering comfort food, or adjusting your environment to help you relax. Unlike traditional AI companions, Motherly.ai doesn’t just listen – it takes care of you.",
    "github": "https://github.com/MingkuanY/ai-mommy",
    "tools": [
      "next.js"
    ]
  },
  {
    "name": "ProtestLink",
    "link": "https://devpost.com/software/protestlink",
    "about": "ProtestLink is a decentralized communication and coordination platform designed to keep protesters connected, informed, and protected even in the face of network disruptions, internet blackouts, and active surveillance. By leveraging Wi-Fi networking, live location sharing, and AI-driven speech analysis, ProtestLink provides an autonomous protest network that helps protesters navigate safely, request critical resources, and broadcast urgent alerts without relying on traditional service providers.\n\nWith ProtestLink, protesters can:",
    "github": "https://github.com/wyang563/protest_app",
    "tools": [
      "axios",
      "bluetooth",
      "esp32",
      "flask",
      "leaflet.js",
      "numpy",
      "openai",
      "openstreetmap",
      "python",
      "react",
      "sentence-transformers",
      "sqlite",
      "stadia",
      "tailwindcss",
      "transformers",
      "typescript",
      "web",
      "webrtc",
      "whisper"
    ]
  },
  {
    "name": "CodeForge Pages",
    "link": "https://devpost.com/software/codeforge-pages",
    "about": "CodeForge Pages asks users to enter information about their company along with the name of the company. Based on this information, CodeForge generates a multi–component landing page in React that contains beautiful layout, text, and style. Users can view the rendered code in either the web-view or a simulated mobile view. When pleased with the website, they can export it–which will download a zip of all the react components. All users are also authenticated – meaning when you create a project, we associate it with your profile and it can be accessed at any time through the dashboard.",
    "github": "https://github.com/KshitijTeotia06/frontendTreeHacks",
    "tools": [
      "beautiful-soup",
      "elasticsearch",
      "fastapi",
      "firebase",
      "next.js",
      "python",
      "react",
      "supabase"
    ]
  },
  {
    "name": "<PriorityQueue>",
    "link": "https://devpost.com/software/priorityqueue",
    "about": "This Next.js project, bootstrapped with `create-next-app`, provides a basic web application. It’s designed for easy development, with automatic page updates when modifying `app/page.tsx`. The project utilizes `next/font` to optimize the Inter Google Font. Getting started involves running `npm run dev` (or a similar command) to start the development server and viewing the application at `http://localhost:3000`. Deployment is simplified through the Vercel Platform.",
    "github": "https://github.com/shrenikpatel17/treeHacks2025",
    "tools": [
      "elastic",
      "mapbox",
      "mongodb",
      "node.js",
      "openai",
      "react",
      "tailwind"
    ]
  },
  {
    "name": "CodeCrack",
    "link": "https://devpost.com/software/codecrack",
    "about": "CodeCrack is an AI-powered mock interview simulator designed to help users prepare for real interviews. Utilizing Next.js, Tailwind CSS, and ElevenLabs’ AI speech-to-speech technology, it provides dynamic feedback on your responses. The platform leverages Vercel for easy deployment and integrates with serverless Redis for rate limiting. Key features include automated transcriptions, AI-driven feedback, and a user-friendly interface. Built with TypeScript, Prettier, and ESLint for robust code quality, CodeCrack aims to improve interview skills through interactive, conversational practice.",
    "github": "https://github.com/kkarenvoo/TreeHacks2025",
    "tools": [
      "elevenlabs",
      "javascript",
      "node.js",
      "python",
      "vercel"
    ]
  },
  {
    "name": "The Duck You Mean?",
    "link": "https://devpost.com/software/the-duck-you-mean",
    "about": "The Duck You Mean is an interactive web app that lets users pick a topic and engage in a back-and-forth conversation where AI plays the role of a curious student. Users must explain concepts, and the AI:",
    "github": "https://github.com/joycechen721/duck-you-mean/",
    "tools": [
      "elevenlabs",
      "luma",
      "mistralai",
      "openai",
      "zoomapi"
    ]
  },
  {
    "name": "EcoBite",
    "link": "https://devpost.com/software/ecobite-qcujae",
    "about": "EcoBite is a mobile app meant for users to take pictures of their leftover food for the main purpose of estimating the food’s weight. After this action on the user’s end, the app will analyze the weight of the food in the image along with classifying its type. On top of being able to record and display this data to users, EcoBite keeps track of individual progress when it comes to food waste, allowing for milestones to be reached when individuals to a good job not creating as much food waste. This information is recorded and held in a backend to be analyzed for generalized food waste trends, all of it location-based. This process of recording images is also great for businesses that produce much food waste in their day to day in order to better keep track of food costs as well as intercept food waste.",
    "github": "https://github.com/SirKentut/EcoBite",
    "tools": [
      "flask",
      "flutterflow",
      "gemini",
      "perplexity",
      "python"
    ]
  },
  {
    "name": "Sprout",
    "link": "https://devpost.com/software/sprout-io",
    "about": "Sprout starts with your student’s drawing. From there, we build an engaging, choose-your-own story, with generative visuals based on your input. The adventure is filled with grade-level vocabulary to hit comprehension goals, with a quick comprehension check at the end.",
    "github": "https://github.com/sdoshi4/Treehacks2025",
    "tools": [
      "dart",
      "fastapi",
      "flutterflow",
      "gemini",
      "genai",
      "google-cloud",
      "imgur",
      "luma",
      "lumalabs",
      "multimodal",
      "python"
    ]
  },
  {
    "name": "Caren AI",
    "link": "https://devpost.com/software/caren-ai",
    "about": "Caren AI automates the insurance claim appeal process and negotiates with insurance providers on behalf of patients. Our AI reads insurance denial letters, cross-references them with Evidence of Coverage (EOC) documents, and calls insurance companies to dispute denials using legally backed arguments.\n\nKey Features:",
    "github": "https://github.com/Tap2Call/flutterflow",
    "tools": [
      "ai",
      "ai-agents",
      "dart",
      "elevenlabs",
      "firebase",
      "flutterflow",
      "gemini",
      "perplexity",
      "twilio"
    ]
  },
  {
    "name": "Navi",
    "link": "https://devpost.com/software/navi-7sp5mz",
    "about": "In short, Navi makes web browsing easier for human users, with accessible voice navigation 🎤, intuitive browsing with user intent prediction 🔮, instant feedback to questions 📝, and personalized further reading suggestions 📚. In terms of serving AI models, Navi extracts web pages more efficiently compared to traditional VLMs. ⚡",
    "github": "https://github.com/danieltyx/navi-browser-agent",
    "tools": [
      "context",
      "elevenlabs",
      "gemini",
      "groq",
      "javascript",
      "mistral",
      "next.js",
      "openai",
      "perplexity",
      "scrapybara",
      "typescript",
      "windsurf"
    ]
  },
  {
    "name": "Spheroid Tumor Invasion Kinetics (STIK) GUI",
    "link": "https://devpost.com/software/tumor-invasion-kinetics-gui",
    "about": "STIK_GUI (Spheroid Tumor Invasion Kinetics GUI) is an AI-powered tool designed to automate the tracking and prediction of tumor spheroid invasion. Instead of manually tracing hundreds of images, researchers can upload their data and let STIK_GUI handle segmentation, analysis, and visualization. The intuitive graphical interface makes it easy to process well plate images, extract invasion kinetics, and generate meaningful insights—saving time and reducing human error.",
    "github": "https://github.com/sonnyloweus/STIK_GUI/",
    "tools": [
      "conda",
      "cvat",
      "pyqt",
      "python",
      "yolo"
    ]
  },
  {
    "name": "Plot",
    "link": "https://devpost.com/software/plot-3pi8c4",
    "about": "This Next.js project, bootstrapped with `create-next-app`, provides a basic web application. Developers can edit the `app/page.tsx` file to modify the content, with automatic updates during development. The project utilizes `next/font` to optimize the Geist font. Deployment is simplified through the Vercel Platform, offering an easy way to deploy the application. The project includes links to official Next.js documentation, learning resources, and the GitHub repository for further exploration and contributions.",
    "github": "https://github.com/toni-akintola/jats",
    "tools": [
      "langchain",
      "mapbox",
      "mistralai",
      "next.js",
      "openai",
      "perplexity",
      "react",
      "recharts",
      "typescript",
      "zustand"
    ]
  },
  {
    "name": "The Anachronist",
    "link": "https://devpost.com/software/the-anachronist",
    "about": "The Anachronist is an educational mystery game that “time warps” players into a historical period that is unknown to them prior to completing the game. Their task? Identify the time and place by carefully observing surroundings, interacting with characters, and analyzing historical details, with a slight twist: Don’t get caught! While learning hints and gaining further context through every conversation, the player must also be conscious of the fact that they should not arouse suspicion, that they are potentially from the future.\n\nFigures within our game range from children, who were brought to Los Alamos as their parents were involved in the Manhattan Project, to figures who symbolize the Manhattan Project to us today. Navigating this world is not just knowing the “timeline” or “facts” of the events, which we grade through a quiz; but instead understanding the very fabric of the community that they are teleported to.",
    "github": "https://github.com/rgu0114/the-anachronist",
    "tools": [
      "elevenlabs",
      "gemini",
      "godot",
      "langchain",
      "lumalabs",
      "nitrode",
      "openai"
    ]
  },
  {
    "name": "Mirror",
    "link": "https://devpost.com/software/mirror-lmd54a",
    "about": "Mirror is an AI-powered app compatible on all AugmentOS-enabled smart glasses which transcribes your conversations and generates actionable insights and summaries tuned for reflection in real time. Our processing agents will automatically update on the Mirror web interface as you speak, intelligently picking out the most appropriate points to give a well-rounded overview of your day, extracting todos, a general snapshot of your day, and important reflection questions.\n\nJust as important as understanding the specific details of your day is being able to look back in time at past memories and see how they fit into the context of the rest of your memories. Mirror offers full-text semantic search through all memory content to allow for quick and easy retrieval and recall of specific details even if you only have a small idea of what you’re looking for.\n\nFurthermore, visualizing the relationships between memories is made easy and beautiful via Mirror’s 3-Dimensional memory map which displays latent connections between memories. Each edge and connected component tells a story and provides insights into the relationships between your experiences.\n\nThe best part – all of this is generated via our processing pipeline in real time as you talk! Throughout the entire day, Mirror will always be up to date with your latest memory insights.",
    "github": "https://github.com/kevinzhu12/treehacks-glasses",
    "tools": [
      "augmentos",
      "elasticsearch",
      "java",
      "mistral",
      "nextjs",
      "react",
      "typescript",
      "windsurf"
    ]
  },
  {
    "name": "TreeTrash",
    "link": "https://devpost.com/software/treetrash",
    "about": "TreeTrash leverages computer vision to analyze images of a trash bin taken at regular intervals. We determine which items were misplaced and what the environmental impact of misplacing those items using a custom search pipeline. When we first notice a misplaced item, we use a display and speaker to notify the person. Then, we generate a custom report about the environmental impact of misplacing certain items, as well as specific recommendations about how to improve.",
    "github": "https://github.com/sonnetx/treehacks-2025",
    "tools": [
      "adafruit",
      "gemini",
      "openai",
      "perplexity",
      "vercel",
      "vespa"
    ]
  },
  {
    "name": "Zue Research",
    "link": "https://devpost.com/software/zue-research",
    "about": "After students describe what they’d like to learn more about, we create multiple adversarial agents which perform “deep research” (i.e. search the web, synthesize, reflect, and repeat). Think anything from “debate the entirety of modern Tunisian history” to “tell me how the organelles of a plant cell differ from those of an animal”.\n\nWhen these agents finish, they summarize their findings and provide related “branches” the students can look into. If the student is done researching, we generate a podcast with visual aids that shows multiple agents debating each other. At any point in the podcast, a student can double click on a segment to have a new research agent answer questions or clarify topics.",
    "github": "https://github.com/zcsabbagh/zu-lm/",
    "tools": [
      "elevenlabs",
      "groq",
      "javascript",
      "langchain",
      "lumalabs",
      "mistral",
      "openai",
      "perplexity",
      "rust",
      "typescript"
    ]
  },
  {
    "name": "Lattice: Orchestrating end-to-end web workflows at scale",
    "link": "https://devpost.com/software/lattice-data-at-your-fingertips",
    "about": "This Next.js project, bootstrapped with `create-next-app`, provides a basic web page accessible at `http://localhost:3000`. Editing `app/page.tsx` automatically updates the page. The project utilizes `next/font` to optimize and load the Geist font family. It’s designed for easy development and deployment, with comprehensive documentation and support from the creators of Next.js and Vercel.",
    "github": "https://github.com/WeltonWang02/spreadsheet_hackathon",
    "tools": [
      "agents",
      "apis",
      "llms",
      "typescript"
    ]
  },
  {
    "name": "Spielberg AI",
    "link": "https://devpost.com/software/spielburg-ai",
    "about": "Spielberg AI is an AI-powered video editor that allows creators to edit videos using only natural language. Instead of manually cutting, trimming, and applying effects, users can describe their desired edits in plain English, and Spielberg AI—powered by the agent, our AI agent—handles the rest. There is a strong emphasis on developing and editing viral videos for the users.",
    "github": "https://github.com/adeng27/treehacks-25",
    "tools": [
      "cuda",
      "elevenlabs",
      "fastapi",
      "ffmpeg",
      "gemini",
      "googlegenai",
      "huggingfacetransformers",
      "langchain",
      "lumalabs",
      "next.js",
      "openai-gpt",
      "openai-whispr",
      "opencv",
      "tailwind"
    ]
  },
  {
    "name": "NeuroPilot: Brainwave Computer Control",
    "link": "https://devpost.com/software/mindcontrolpc-control-computer-with-brainwaves",
    "about": "NeuroPilot translates neural EEG signals (brainwaves) into natural language commands and allows users to control computer functions simply by imagining speech; it is a real-time, end-to-end EEG-to-action pipeline. Put simply, it allows users to control computers with their minds.",
    "github": "http://github.com/nicolesplaining/treehacks/tree/main",
    "tools": [
      "api",
      "brainflow",
      "firebase",
      "huggingface",
      "openai",
      "openbci",
      "python",
      "pytorch",
      "scrapybara"
    ]
  },
  {
    "name": "Supernova",
    "link": "https://devpost.com/software/supernova-p1tum5",
    "about": "Supernova takes a single product link as its input and handles everything else:",
    "github": "https://github.com/pr28416/ai-ugc",
    "tools": [
      "agents",
      "cartesia",
      "groq",
      "heygen",
      "nextjs",
      "openai",
      "perplexity",
      "runway",
      "supabase"
    ]
  },
  {
    "name": "Runway",
    "link": "https://devpost.com/software/runway-x0ca3y",
    "about": "Runway lets anyone access and build AI models that they want—from non-technical to 10x engineers.\n\nUsing solely natural language (and no ML background), you can:",
    "github": "https://github.com/abhi-arya1/runway",
    "tools": [
      "browserbase",
      "fastapi",
      "groq",
      "lambda",
      "nextjs",
      "perplexity",
      "python",
      "sagemaker",
      "supabase"
    ]
  },
  {
    "name": "Trailhead",
    "link": "https://devpost.com/software/trailhead",
    "about": "Our project, Trailhead, generates developer maps for any skillset you can imagine. Whether it's learning how to cook an omelet or becoming an expert at chess, Trailhead will converse with you in order to figure out your learning objectives, current knowledge, and preferences for sources, creating a personalized workflow for you to achieve your goal. Trailhead stores your learning plans as \"hikes\", allowing you to revisit any of the sources you've already studied. You can then mark your \"vistas\" as completed to ensure you receive new, advanced content in your tree. Our web app has several features, including tree generation, tree interaction and viewing, and an RLHF and vector embeddings-based recommendation system representing user learning preferences. We also have a side-quests feature to recommend topics and learning path which the user is most likely to be interested in learning but hasn't though about.",
    "github": "https://github.com/womogenes/trailhead/tree/interactive",
    "tools": [
      "css",
      "fastapi",
      "github",
      "html",
      "javascript",
      "luma",
      "next",
      "openai",
      "perplexity",
      "pydantic",
      "python",
      "sql",
      "supabase",
      "tailwind",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "StoryBridge",
    "link": "https://devpost.com/software/storybridge-z5nrht",
    "about": "StoryBridge is an AI-generated story creation platform that empowers parents, teachers, and young students to create personalized bilingual storybooks in English and a second language.\n\nFrom original adventures to classic fairy tales, StoryBridge helps children bridge the gap between their culture and the culture of the country they were born in, making language learning a natural and engaging experience.",
    "github": "https://github.com/getina/TreeHacks2025/tree/0a03963078bc1c19598467dd76514388d0e45d8a",
    "tools": [
      "javascript",
      "lumalabs",
      "node.js",
      "openai",
      "perplexity",
      "python"
    ]
  },
  {
    "name": "ArmI",
    "link": "https://devpost.com/software/armi",
    "about": "ArmI is an application that through data extracted from wearable devices provides workout advice based on individual biometrics through the use of a powerful reinforcement learning model. This allows for an adaptive and self-improving model that does not generalize for a population but tailors for the needs of every soldier.",
    "github": "https://github.com/karammasad/ArmI/tree/main/api",
    "tools": [
      "artificial-intelligence",
      "cloudflare",
      "dart",
      "flutterflow",
      "machine-learning",
      "python",
      "reinforcement-learning",
      "terraapi"
    ]
  },
  {
    "name": "Tradelingo",
    "link": "https://devpost.com/software/tradelingo",
    "about": "Tradelingo is a cutting-edge stock intelligence platform that leverages quantum computing and real-time market insights from the web via DeepSeek AI to generate 97% accurate stock forecasts and portfolio optimizations with built-in risk management. Our goal is to make top quality financial literacy more accessible to everyone. Our platform delivers personalized, easy-to-understand reports based on user preferences, such as age, interests, and selected stocks—offering actionable investment recommendations tailored for all experience levels. With quantum algorithms, Tradelingo provides hyper-accurate predictions at any interval (per second, minute, day, or month), while DeepSeek AI compiles top market articles and financial reports into concise, insightful summaries. Designed with accessibility in mind, Tradelingo empowers everyone, from students building financial literacy to older adults seeking simplified tools, to navigate the stock market with confidence and clarity.",
    "github": null,
    "tools": [
      "alphavantage",
      "elasticsearch",
      "fastapi",
      "google-colab",
      "groq",
      "natural-language-processing",
      "next.js",
      "openai",
      "python",
      "qbraid",
      "qiskit",
      "rag",
      "youtube-data-api"
    ]
  },
  {
    "name": "VisionMate: the AI agent to help visually impaired people",
    "link": "https://devpost.com/software/orion-pcwlg3",
    "about": "VisionMate is an AI-powered assistive suite designed for visually impaired users, aiming to redefine accessibility through seamless navigation. It utilizes real-time text-to-Braille conversion, image-to-audio narration, and object awareness detection via ARKit and Apple Watch integration. The system dynamically adapts, choosing the best assistive tool based on context and providing haptic feedback for object detection. Built with AI/ML technologies like OpenAI and Apple Core ML, VisionMate offers gesture-based control and prioritizes individual user needs for enhanced independence and inclusivity.",
    "github": "https://github.com/anaiskillian/treehacks25",
    "tools": [
      "c++",
      "openai",
      "python",
      "swift",
      "typescript",
      "watchos"
    ]
  },
  {
    "name": "Mustard Seed",
    "link": "https://devpost.com/software/mustard-seed",
    "about": "AI Journalling app to use LLM to categorize entries in specific areas useful to note one's progress as they journey through their Christian life(areas of sin, thanksgiving events, people events etc).",
    "github": null,
    "tools": [
      "flutterflow"
    ]
  },
  {
    "name": "Om: Optimized Meditation",
    "link": "https://devpost.com/software/om-optimized-meditation",
    "about": "We developed an AI-driven system that personalizes meditation in real-time by integrating biometric data and visual analysis:\n\nBiometric Wearable Data: Tracks heart rate variability, respiratory rate, electrodermal activity, blood volume pulse, and body temperature to assess physiological responses.\n\nAI-Powered Visual Analysis: Uses video to monitor facial muscle tension, eye movement, head positioning, postural sway, and micro-expressions, providing insights into cognitive engagement and emotional states.\n\nAI-Powered Personalization & Feedback:",
    "github": "https://github.com/rahulrejeev/treehacks-2025.git",
    "tools": [
      "amazon-web-services",
      "deep-learning",
      "gemini-flash-2.0",
      "opencv",
      "perplexity",
      "python",
      "relational-databases",
      "streamlit",
      "terra-api",
      "visual-language-models",
      "vlm"
    ]
  },
  {
    "name": "Turwin",
    "link": "https://devpost.com/software/turwin",
    "about": "Turwin is a hackbot that can detect unauthorized access vulnerabilities on an API. In particular, it focuses on access control vulnerabilities that currently no open source cybersecurity automation can detect.\n\nBelow is an example that showcases Turwin's capabilities. In our case, we use an EHR simulation, where users can register as either patients or doctors. Patients can update their profile details and view their own test results, while doctors can create and access test results for specific patients. To make Turwin modular and easy to maintain, we have made our EHR simulation plain and simple, implementing only fundamental features of modern EHRs.\n\nLet’s say Alice, a patient, logs in and requests her test results through an API call like: GET /api/test_results?patient_id=123 But what happens if Alice manually changes the patient ID to Bob’s (456) in the request? GET /api/test_results?patient_id=456\n\nIf the API doesn’t properly enforce access control policies in their codebase, this endpoint could return Bob’s private medical records to Alice upon request, which would have caused a serious security breach.\n\nTurwin detects this vulnerability long before it can be exploited by malicious parties. Preferably, Turwin would be run in development and staging environments by companies, long before products meet the end users.",
    "github": "https://github.com/Turwin1729/turwin.git",
    "tools": [
      "burpsuite",
      "kubernetes",
      "llm",
      "openapi",
      "playwright",
      "python",
      "react",
      "windsurf"
    ]
  },
  {
    "name": "SquadPulse: A Military Healthcare Analytics Platform",
    "link": "https://devpost.com/software/squadpulse-a-military-healthcare-analytics-platform",
    "about": "SquadPulse leverages advanced data analytics to classify each soldier’s cardiac signals into categories—regular, irregular, or AFib—based on photoplethysmography (PPG) data and broader metadata. We utilized deep learning models (trained in Python, PyTorch, TensorFlow, and Excel pivot-based data orchestration) to ensure the system and model pinpoints anomalies. Commanders can view squad-level health or deep-dive into individual soldier stats in real time.\n\nSquadPulse at its core is a centralized dashboard that provides real-time insights. But where it truly shines is its multimodal analysis engine. We've integrated our PPG analysis with external datasets including EEG signals, stress biomarkers, and performance metrics to provide unprecedented insights into:",
    "github": "https://github.com/michelleweon/treehacks-2025",
    "tools": [
      "fastapi",
      "matplotlib",
      "numpy",
      "openai",
      "perplexity",
      "python",
      "pytorch",
      "react",
      "rshiny",
      "tensorflow",
      "terraapi",
      "typescript"
    ]
  },
  {
    "name": "J.A.R.V.I.S. — Augment Human Connection with Infinite Memory",
    "link": "https://devpost.com/software/j-a-r-v-i-s-augment-human-connection-with-infinite-memory",
    "about": "That’s why we built JARVIS—an accessible, intelligent assistant designed to enhance social connection and memory recall. Whether you're having a conversation, trying to remember a name, or looking for common interests to spark a discussion, JARVIS is always there. It scours the internet to find mutual interests, recalls past conversations, and provides helpful context, ensuring that every interaction feels effortless and deeply personal.\n\nFor individuals with dementia, JARVIS serves as a memory aid, helping them remember people, past experiences, and meaningful connections. For those with physical disabilities, it provides a seamless, hands-free way to interact with the world. By bridging the gap between human memory and technological capability, JARVIS doesn’t just make life easier—it makes life more fulfilling.",
    "github": "https://github.com/apple-314/treehacks25/tree/main",
    "tools": [
      "all-minilm",
      "all-minilm-l6-v2-agentic-ai:-langchain",
      "avfoundation",
      "beautiful-soup",
      "beautifulsoup-facial-recognition:-dlib",
      "cncontact",
      "dlib",
      "face-recognition",
      "face-recognition-frontend:-swiftui",
      "groq",
      "iris",
      "langchain",
      "llama",
      "llama-transcription:-whisper-(multilingual)-web-scraping:-selenium",
      "openai",
      "python",
      "realitykit",
      "selenium",
      "sql",
      "sql-database:-intersystems-iris",
      "swift",
      "swiftgestures",
      "whisper"
    ]
  },
  {
    "name": "SnapAR3D",
    "link": "https://devpost.com/software/snapar3d",
    "about": "SnapAR3D uses AR to guide you in capturing optimal photos of an object, while precisely recording the camera’s positions and orientations relative to that object. This data is transformed into matrices and imported into NVIDIA Diffractive Reconstruction (nvdifrec) to generate high-quality 3D models.",
    "github": "https://github.com/wwangg22/treehcks",
    "tools": [
      "arkit",
      "colmap",
      "javascript",
      "opencv",
      "python",
      "realitykit",
      "swift",
      "swiftui"
    ]
  },
  {
    "name": "Aegis",
    "link": "https://devpost.com/software/aegis-kz4qnm",
    "about": "Aegis is a wearable device that combines biometrics with computer vision to assess trauma and deliver accurate, life-saving medicine. Using an Apple Watch for vital sign monitoring and a camera system for wound analysis, Aegis is able to make informed decisions about medical interventions. Our current prototype features a dual-reservoir system with peristaltic pumps—one that would contain a hemostatic agent for bleeding control and the other with pain medication (such as Morphine).\n\nIn most cases, users of Aegis would be in areas without an active network connection, which encouraged us to pursue an edge-based solution with the capability to process complex medical data efficiently. What further sets Aegis apart is its centralization through a command and control center, allowing unit leaders to monitor their team's medical status and location in real-time through a detailed UI and natural language queries like \"Who is most injured and where are they?\"",
    "github": "https://github.com/SpotDylan/TreeHacks-2025-Fullstack",
    "tools": [
      "elevenlabs",
      "gemini",
      "jetson-nano",
      "mistral",
      "next.js",
      "supabase",
      "swift",
      "terra",
      "vercel"
    ]
  },
  {
    "name": "ConvoCoach",
    "link": "https://devpost.com/software/convocoach-ipvah3",
    "about": "Convo Coach helps users reduce filler words in their speech by providing real-time AI-powered feedback. When a user records themselves speaking, the app accurately transcribes their speech, highlighting unnecessary fillers like “um,” “like,” and “uh.” After analyzing the speech, an AI avatar responds dynamically, providing personalized feedback on areas for improvement, such as suggesting pauses before complex phrases or reducing filler words for clearer communication. By offering instant, interactive feedback in a judgment-free environment, Convo Coach helps users refine their speech and build confidence in their communication skills.",
    "github": "https://github.com/lag-gam/ConvoCoach",
    "tools": [
      "ai",
      "ai-applied-sentiment-analysis",
      "assembly-ai",
      "css",
      "d-id",
      "flask",
      "html",
      "javascript",
      "natural-language-processing",
      "python",
      "react"
    ]
  },
  {
    "name": "Chronos Calendar",
    "link": "https://devpost.com/software/chronos-calendar",
    "about": "At a high level, Chronos is a set of intelligent agents working together to find the intent behind your prompt and schedule your event for you in real-time. We have combined this agentic workflow with a beautiful UI/UX to create a truly comprehensive AI scheduling assistant.\n\nPrompt Chronos to create, modify, or delete simple events like “Lunch with James at 12:45pm tomorrow”, or even complex queries like “I want to go to the gym with kunal@email.com at 8am every other day for the next 3 weeks.” P.S.--adding your university course schedule for the quarter/semester has never been easier!\n\nPreferences act as your “user profile.” This is where you put conditions that don’t often change and that Chronos must always keep in mind, i.e. “I don’t want to have any meetings after 6pm.”",
    "github": "https://github.com/sfkunal/Chronos",
    "tools": [
      "chromadb",
      "figjam",
      "figma",
      "google-calendar-api",
      "groq",
      "llama",
      "next.js",
      "python",
      "react"
    ]
  },
  {
    "name": "booksy",
    "link": "https://devpost.com/software/booksy",
    "about": "booksy is an AI-powered storytelling platform designed to combat limited family time and foster connection. It enables families to collaboratively create interactive storybooks by blending AI-generated narratives with personalized illustrations and video recordings. The platform allows users to co-create unique stories, engage in choose-your-own-adventure formats, and preserve memories through an immersive, multimedia experience.  Booksy utilizes handcrafted design and AI, prioritizing creativity, accessibility, and immersion to transform shared moments into cherished, interactive digital time capsules.",
    "github": "https://github.com/gigabite-pro/treehacks-25",
    "tools": [
      "elevenlabs",
      "groq",
      "javascript",
      "lumalabs",
      "react",
      "supabase"
    ]
  },
  {
    "name": "Phonix",
    "link": "https://devpost.com/software/phonix-w943zc",
    "about": "Phonix is a speech therapy web app designed to help stroke patients and others with language impairments regain speech through personalized practice. Utilizing generative AI, computer vision, and natural language processing, it offers accessible and effective therapy at home. The app identifies user weaknesses through speech and facial analysis, generating targeted exercises and providing real-time feedback, mimicking a traditional speech therapist. Phonix aims to address the cost and accessibility barriers of existing speech therapy while catering to a broad audience, including stroke patients, the elderly, and English language learners.",
    "github": "https://github.com/MakerofMarkers/treehacks2025",
    "tools": [
      "allosaurus",
      "css",
      "dlib",
      "elevenlabs",
      "flask",
      "gpt4o-mini",
      "icspeechmouthpositioning",
      "javascript",
      "openai",
      "opencv",
      "python",
      "randomwordapi",
      "react",
      "sqlite",
      "whisperai"
    ]
  },
  {
    "name": "GenuisAI",
    "link": "https://devpost.com/software/genuius-your-genuine-genius",
    "about": "Genuis is an AI-powered study assistant that delivers fact-checked, course-specific tutoring by pulling directly from uploaded lecture notes, textbooks, and classroom materials. It never hallucinates answers—it simply doesn't generate responses unless it finds relevant context in your uploaded resources.\n\nAnd for those tired of copying and pasting to feed a chat bot content you want clarification on—we do exactly that! We keep an extensive database of all the prompts you’ve entered previously which is often refactored and holds on to the contents of pdfs, html, and even youtube videos that can deliver your answers and thorough understanding. Ensuring your minimal input, the database considers specific courses, professors, office hours, assignments, lectures, and much more so that you get answers at the click of a button. And the icing on the cake—our voice feature with vocal output option that makes it so you don’t even have to read!",
    "github": "https://github.com/fabianmolinaEE/TreeHacks25",
    "tools": [
      "amazon-web-services",
      "api",
      "elasticsearch",
      "elevenlabs",
      "flutterflow",
      "groq",
      "openai",
      "perplexity",
      "python",
      "query",
      "tts",
      "whisper"
    ]
  },
  {
    "name": "Identity AI",
    "link": "https://devpost.com/software/identity-ai",
    "about": "Our project can be used to detect even the most perfectly crafted false identity card. We know that at least one of the fields on this ID is falsified, whether it be the photo, name, birthday, address, or all of the above. And, if the fields are all valid, then we can check the similarity of the ID photo to the face of its holder. So, we leverage web scraping, machine learning, and AI agents to find these discrepancies. We take pictures of a person and their ID using the Meta Ray Bans glasses, process this information, and utilize agents to crawl the internet and verify the validity of the ID. We have a web UI where a user can view the results of our search, which include a face-matching confidence score, address, age, and other identifying information. Our project uses a multitude of strategies to achieve this goal. We built a web scraper to perform reverse image searching. We leverage Perplexity’s Sonar and other online sources to validate the person’s name, age, and address. At the end of this workflow, Identity AI presents results to the user, who will then know the validity of an ID regardless of its quality.",
    "github": "https://github.com/mschubs/IdentityAI",
    "tools": [
      "anthropic",
      "fastapi",
      "fastpersonsearch",
      "firecrawl",
      "groq",
      "openai",
      "perplexity",
      "python",
      "react",
      "typescript"
    ]
  },
  {
    "name": "ChainEscapeLite",
    "link": "https://devpost.com/software/chainescapelite",
    "about": "ChainEscape is a live, decentralized escape room leveraging EigenLayer’s Level 1 Agents and AVS to create an immersive experience. Teams solve puzzles dynamically generated by an off-chain AI, linked to real-time blockchain events. The game utilizes a central dashboard with interactive puzzles like visual murals, trivia, and simulations, constantly evolving based on user choices and on-chain activity. Persistent memory ensures unique playthroughs, and surprise events add further complexity. This project demonstrates secure, transparent AI processing connected to on-chain actions, creating a memorable and replayable game experience.",
    "github": "https://github.com/tunderulesagain/Chainescape-Lite",
    "tools": [
      "ai:-openai-gpt-4-verifiability:-opacity-(zktls-proofs)-data-availability:-eigenda-smart-contracts:-solidity",
      "ethers.js-blockchain:-ethereum",
      "hardhat",
      "layer-2-scaling-frontend:-react.js"
    ]
  },
  {
    "name": "Blacksmith",
    "link": "https://devpost.com/software/blacksmtih",
    "about": "Blacksmith is a no-code, text-only ML training and deployment automation platform. Buzzwords aside, all this means is you put in text, you get out ML models :) With just simple prompts like “Create an ML model based on George Washington”, you’ll get a personalized, historically accurate agent for the first president. Not only do you immediately have access to the chatbot just 10 minutes after you request your model, you also have an API endpoint that can then be as part of your larger multi-agent workflow.\n\nTraditionally, this process is extremely tedious and impossible for someone who is just getting into machine learning. For finetuning models, data has to be manually scraped and collected, converted into a Q/A format, labeled, uploaded, and finetuned. For training models from scratch, it’s even worse! You need to set up the machine learning codebase yourself and be very very careful when training these sensitive models. We want machine learning to be accessible to everyone, with the power of personalized agents in every person and organization’s hands.\n\nBlacksmith makes this possible. Given the text prompt, it first figures out the type of model and data that should be used. Then we use our extremely fast, custom, multi-agent Computer Use system to jump through webpages and extract raw data for our model. The data is automatically organized and labeled, then GPT and/or Mistral is used for the finetuning process.\n\nOnce the model is fully trained, you have access to the API endpoint and the chatbot, making the world your oyster!",
    "github": "https://github.com/tejasprabhune/blacksmith",
    "tools": [
      "computer-use",
      "fastapi",
      "gpt",
      "mistral",
      "muli-agent-workflow",
      "next.js",
      "openai",
      "python",
      "selenium",
      "typescript"
    ]
  },
  {
    "name": "Pyro*AI",
    "link": "https://devpost.com/software/pyro-ai",
    "about": "Pyro.AI is a centralized wildfire monitoring dashboard developed to enhance wildfire management and community resilience. Built with NextJS, Flask, TypeScript, and Python, it utilizes YOLOv8 for automated fire detection from live camera feeds and OpenRouteService to calculate optimal evacuation routes. The system incorporates Google Gemini for real-time safety guidance, analyzing environmental data alongside live camera feeds. Inspired by the 2025 Palisades and Eaton fires, Pyro.AI aims to provide timely detection, efficient evacuation planning, and crucial safety information to mitigate wildfire risks and protect communities.",
    "github": "https://github.com/EthanSantos/pyroai",
    "tools": [
      "mapbox",
      "nextjs",
      "python",
      "pytorch",
      "tensorflow"
    ]
  },
  {
    "name": "TeachAI",
    "link": "https://devpost.com/software/teachai-kwfvas",
    "about": "TeachAI functions as an AI-driven teaching assistant, empowering students to ask homework and lecture-related questions on a unified platform. If a student feels more comfortable learning in another language, TeachAI provides text-based and audio explanations in over 30 different languages. This inclusive feature ensures that language proficiency is no longer a barrier to classroom success. On the teacher’s side, TeachAI helps with grading, offers a chatbot that keeps them informed on the topics students struggle with the most, and integrates email functionality to send class-wide updates. It also syncs with the Zoom API and utilizes AI summarization capabilities, enabling teachers and students to revisit concise summaries of their virtual classes whenever they need to review or catch up.",
    "github": "https://github.com/Laoluog/TeachAI/tree/main",
    "tools": [
      "flask",
      "gemini",
      "json",
      "nextjs",
      "openai",
      "python",
      "react",
      "typescript",
      "zoomapi"
    ]
  },
  {
    "name": "Bongaloons (Bongo Cat IRL)",
    "link": "https://devpost.com/software/bongaloons",
    "about": "Bongaloons is a project combining Bongo Cats and Guitar Hero, where you get to play with bongos (physical buttons attached to our custom game pad) to beats of many pop songs, meme soundtracks, and any audios of your choosing.",
    "github": "https://github.com/bongaloons/bongaloons/",
    "tools": [
      "a100",
      "cuda",
      "hardware",
      "lasercutting",
      "mediapipe",
      "python",
      "redis",
      "stm32",
      "tensorflow",
      "vite"
    ]
  },
  {
    "name": "Genetic Disorder Detection via cDNA Frequency Map",
    "link": "https://devpost.com/software/genetic-disorder-detection-via-cdna-frequency-map",
    "about": "Current fetal genomic examinations involve dangerously invasive processes for extracting amniotic fluid, risking infection and physical hazards. Our approach facilitates minimally invasive cDNA extraction from the mother's blood, which is then put through our extensive model to reconstruct the baby's genome and reveal any concerning anomalies.",
    "github": "https://github.com/mhtruong1031/treehacks2025",
    "tools": [
      "juypyter",
      "nvidia",
      "python"
    ]
  },
  {
    "name": "Tesla VLM Track",
    "link": "https://devpost.com/software/tesla-vlm-track",
    "about": "The project integrates LangChain with OpenAI’s GPT models (and potentially Groq’s models) to handle conversational AI, maintain session memory, and process vision-related inputs.",
    "github": null,
    "tools": [
      "chroma",
      "numpy",
      "ollama",
      "openai",
      "pandas",
      "python",
      "pytorch"
    ]
  },
  {
    "name": "Sync",
    "link": "https://devpost.com/software/sync-79r18p",
    "about": "Sync is a comprehensive fitness platform that revolutionizes workout planning for female athletes through several key components:",
    "github": "https://github.com/isakaii/sync",
    "tools": [
      "elevenlabs",
      "gemini",
      "nextjs",
      "perplexity",
      "react",
      "supabase",
      "terraapi",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "eHealth",
    "link": "https://devpost.com/software/r2d2-ltwyxd",
    "about": "eHealth is a multimodal agentic system which has the autonomy to move itself simply given a request to pick up and drop off anything in its environment. It is powered by two Visual Language Models, or VLMs, hosted locally on an Nvidia Jetson, and uses a Raspberry Pi to make API calls to both secondary devices and cloud computed LLMs. Beyond its tech, eHealth was made to be as helpful as possible to as many people as possible. In the context of disability support, it autonomously identifies and retrieves objects in the environment based on natural language requests or app-based instructions. The agent's ability to be controlled via a joystick provides an additional layer of accessibility for users with different abilities, or for remote home and family safety. In the field of healthcare, eHealth can help with basic patient care tasks, freeing up healthcare workers for more complex duties or more emotionally impactful encounters. The remote monitoring capability allows healthcare providers to oversee multiple rooms efficiently while maintaining patient privacy and safety.\n\nIn mental health settings, the agent serves as both a physical assistant and a consistent presence, helping patients maintain routines and complete daily tasks while providing data about activity patterns through its monitoring system.",
    "github": "https://github.com/sohvasa/treehacks",
    "tools": [
      "gemini",
      "google",
      "jetson-nano",
      "nvidia",
      "python",
      "raspberry-pi",
      "vlm"
    ]
  },
  {
    "name": "Roomba Nurse",
    "link": "https://devpost.com/software/roomba-nurse",
    "about": "This project, “roomba-ai,” explores machine learning techniques using the “Nurses Stress Prediction” dataset from Kaggle. The dataset contains nurse stress levels and related factors. The project aims to perform Exploratory Data Analysis (EDA) and Principal Component Analysis (PCA) on this data. The focus is on understanding the relationships within the data and potentially identifying key features impacting nurse stress levels. The goal is to apply basic ML techniques, likely for predictive modeling, within this dataset.",
    "github": "https://github.com/KevinWu098/roomba-ai",
    "tools": [
      "cnn",
      "gemini",
      "nextjs",
      "openai",
      "raspberry-pi",
      "roomba"
    ]
  },
  {
    "name": "Heart-BEATS",
    "link": "https://devpost.com/software/heart-beats-1snate",
    "about": "Heart-BEATS listens to the user’s bodily signals, specifically their heartbeat, and uses real-time signal processing to generate custom music beats. Measuring several attributes of the heartbeat enables us to estimate a user’s emotions. Heart-BEATS adjusts the music accordingly, helping to restore a sense of calm and stability.",
    "github": "https://github.com/shainotshy1/HeartBEAT_TreeHacks2025",
    "tools": [
      "arduino",
      "groq",
      "openai",
      "pygame",
      "python"
    ]
  },
  {
    "name": "SeedLink",
    "link": "https://devpost.com/software/seedlink-8jrdxe",
    "about": "SeedLink is an AI-powered platform that guides users in planting endangered species based on their location and environmental conditions. Users can:",
    "github": "https://github.com/vicksey/SeedLink.git",
    "tools": [
      "google-cloud",
      "google-spreadsheets",
      "javascript",
      "mistral",
      "perplexity",
      "react"
    ]
  },
  {
    "name": "D.E.V.I.S",
    "link": "https://devpost.com/software/d-e-v-i-s",
    "about": "Generates apps based on voice input and even uses computer use agents to mimic UI designs.",
    "github": "https://github.com/jessechoe10/DEVIS",
    "tools": [
      "computer-use",
      "elevenlabs",
      "gemini",
      "o1",
      "scrapybara",
      "vlms"
    ]
  },
  {
    "name": "ArticuAIte",
    "link": "https://devpost.com/software/articuaite",
    "about": "ArticulAIte automates first-round interviews by enabling companies to create AI-powered interviewers that dynamically assess candidates based on customizable prompts. The platform provides:\n\nAutomated Interview Generation – Recruiters input a prompt (e.g., “Assess technical skills for a backend developer. Ask about algorithms and data structures.”), and ArticulAIte generates a structured interview with relevant questions.\n\nCustomizable Evaluation Criteria – The AI generates a list of assessment metrics based on the prompt and questions, ensuring standardized evaluations across candidates.\n\nAI-Driven Interview Deployment – Interviews can be conducted in VR or on a web-based interface, where candidates interact with an AI avatar interviewer.\n\nPost-Interview Analysis & Justification – ArticulAIte analyzes responses, extracts key metrics, and cites specific reasoning for each score, providing transparent, data-driven feedback.\n\nThis allows companies to efficiently scale hiring, reduce recruiter workload, and ensure objective candidate assessments while giving candidates clear insights into their interview performance.",
    "github": "https://github.com/MohamedHAbdelnaby/ArticulAIte",
    "tools": [
      "chatgpt",
      "langchain",
      "metaquest",
      "nvidia",
      "omniverse",
      "openai",
      "unity",
      "verecel"
    ]
  },
  {
    "name": "Talk",
    "link": "https://devpost.com/software/talk-6vkz8d",
    "about": "Talk automates quick, daily voice or video calls among members of a 12-step recovery group by predicting each user’s availability. The platform cues users when they’re likely to be free, then starts a short, time-capped call to reduce call anxiety and encourage more frequent check-ins. In this way, Talk helps users maintain consistent accountability and support without the stress of scheduling or the pressure of long, daunting conversations.",
    "github": "https://github.com/danielodicho/Talk",
    "tools": [
      "figma",
      "firebase",
      "flutterflow",
      "google-colab",
      "openai",
      "perplexity",
      "python",
      "twilio",
      "windsurf"
    ]
  },
  {
    "name": "Grant Scoper",
    "link": "https://devpost.com/software/grant-scoper",
    "about": "The user inputs a query of a project that they hope to find funding for or work on. Grants Search then searches for funding opportunities (grants, fellowships, scholarships), ongoing projects and research (including NIH funded work), and student and university organizations to find opportunities most closely related to the user’s project of interest. The funding amount and timeline is displayed for all opportunities. The user’s search can be further narrowed down by their academic status at the university (Undergraduate, Masters, Coterm, PhD, Postdoc, Faculty).",
    "github": "https://github.com/Bio-Programmer/grants-search",
    "tools": [
      "nextjs",
      "python",
      "react",
      "tailwindcss"
    ]
  },
  {
    "name": "Engage: Real-time AI Agents for Smarter Classrooms",
    "link": "https://devpost.com/software/engage-real-time-ai-agents-for-smarter-classrooms",
    "about": "Engage is powered by a real-time multimodal AI, analyzing video, audio, and text to assess student attentiveness, participation, and comprehension, both per-class and long term. It also offers live content generation features to assist teachers by instantly creating learning aids, allowing for evolving presentations which answer students’ questions with increased clarity. From a live classroom feed, the system:",
    "github": "https://github.com/luca-borletti/engage-ai",
    "tools": [
      "gemini",
      "intersystems",
      "multimodal",
      "rag",
      "video"
    ]
  },
  {
    "name": "SquadPulse",
    "link": "https://devpost.com/software/squadpulse",
    "about": "In today’s world, preventive healthcare is more important than ever. Fitness tracking has evolved beyond counting steps and it’s about understanding the body’s signals and making informed health decisions.\n\nBy integrating PPG-based biometrics, AI-driven insights, and personalized health analytics, modern fitness tracking can go beyond generic recommendations to adaptive wellness solutions. Whether it’s detecting early arrhythmias, monitoring recovery patterns, or personalizing training regimens, the future of fitness is precision-driven and data-backed.\n\nFrom elite athletes to everyday users, real-time health tracking bridges the gap between fitness and medicine, ensuring that everyone can train smarter, recover better, and live healthier.\n\n🚀 The future of health tracking isn’t just about numbers. It’s about unlocking human potential.",
    "github": "https://github.com/jathinsn27/Squad_pulse",
    "tools": [
      "chroma",
      "delve",
      "perplexity",
      "python",
      "react",
      "terra"
    ]
  },
  {
    "name": "Tradegentix",
    "link": "https://devpost.com/software/agentictraders",
    "about": "This project creates an automated stock decision system leveraging real-time data and AI. Using the Alpaca API and Perplexity AI, it analyzes stock trends via a CUDA-powered Decision Model, generating explanations for decisions. Data, including stock data and analysis results, is stored in Firebase Firestore for easy access and retrieval. The backend utilizes a Python environment with a Flask API to expose the results.  Users must clone the repository, set up the Python environment, and configure Firebase credentials before running the main pipeline or the API.",
    "github": "https://github.com/danielgao20/tradegentix",
    "tools": [
      "agents",
      "c++",
      "cuda",
      "flutterflow",
      "llm",
      "perplexity",
      "python",
      "vlm"
    ]
  },
  {
    "name": "Surgentic",
    "link": "https://devpost.com/software/surgentic",
    "about": "Surgentic is an AI-powered surgical safety assistant utilizing real-time voice interaction, screen recording, and automated checklist management to enhance surgical procedures and compliance. Built with Next.js, Tailwind CSS, and Supabase, it features a modern interface with dark mode and generates compliance reports.  The system records procedures, provides interactive WHO surgical safety checklists, and utilizes ElevenLabs for voice AI.  It’s designed to improve training, quality assurance, and documentation, offering a persistent conversation history and responsive design for medical environments. Installation involves cloning the repository, installing dependencies, and configuring environment variables for Supabase and ElevenLabs API keys.",
    "github": "https://github.com/SeanZCai/treehacks-agentic-surgeon",
    "tools": [
      "css",
      "elevenlabs",
      "gemini",
      "javascript",
      "neon",
      "openai",
      "perplexity",
      "python",
      "react",
      "supabase",
      "terra-ai",
      "typescript"
    ]
  },
  {
    "name": "Shopybara",
    "link": "https://devpost.com/software/shopybara",
    "about": "Our web application curates your personal aesthetic based on your music preferences and visual inspirations through platforms like Spotify and Pinterest. We then interpret and analyze this data to suggest personalized interior design recommendations (i.e. specific products, links, etc.) that truly reflect your individual style.\n\nKey features include the following: Taste Analysis Engine (processes personal data from Spotify and Pinterest to understand both emotional and visual preferences), Intelligent Shopping Assistant (leverages LLMs to provide curated product recommendations that match your unique style profile).",
    "github": "https://github.com/sabrinahu5/shopybara",
    "tools": [
      "css",
      "javascript",
      "python",
      "typescript"
    ]
  },
  {
    "name": "MindShift: AI for Bipolar Care",
    "link": "https://devpost.com/software/mindshift-wpy6re",
    "about": "MindShift bridges the gap between bipolar patients and their therapists or support networks. Using biometric data from the Apple Watch, we monitor key physiological indicators like heart rate variability, sleep patterns, activity levels, and agitation—metrics that research has linked to extreme mood episodes.\n\nWhen significant shifts occur, MindShift detects them and initiates an adaptive conversation with the patient. Simultaneously, this data is synced to the Therapist Dashboard, providing real-time access to patient biometrics and behavioral assessments. The dashboard also generates AI-driven recommendations to guide patients back to stability and help therapists make informed decisions. By restoring social connection and emotional balance, MindShift strengthens the support system for those who need it most.",
    "github": "https://github.com/vikram087/Treehacks25",
    "tools": [
      "chroma",
      "elevenlabs",
      "flask",
      "gemini",
      "mistral",
      "react",
      "terra"
    ]
  },
  {
    "name": "ResearchLens",
    "link": "https://devpost.com/software/researchlens",
    "about": "ResearchLens is an AI-powered platform that helps researchers quickly discover, summarize, and understand research papers. It allows users to upload papers and provides a suite of features such as finding similar papers, generating concise summaries, offering recommendations for related work, and converting text to speech. The goal is to make research more accessible, efficient, and manageable, especially for students and academics dealing with long and complex research articles.",
    "github": null,
    "tools": [
      "pgvector",
      "postgresql",
      "python",
      "react",
      "supabase",
      "tailwind",
      "typescript",
      "vite"
    ]
  },
  {
    "name": "CogniBoost",
    "link": "https://devpost.com/software/cogiboost",
    "about": "CogniBoost uses your household objects and advanced computer-vision, augmented reality, and RAGs to process multimodal sources of input, mostly visual data, and spatiotemporal marked tasks to generate dynamic short-length tasks for your everyday acute-cognition strength. The goalWe focus on three of the major contributors to growth in sharpness and their useful visuospatial tasks:",
    "github": "https://github.com/rg0727/cogtaskapp",
    "tools": [
      "flask",
      "next.js",
      "openai",
      "react",
      "vercel"
    ]
  },
  {
    "name": "ASL Live Translator",
    "link": "https://devpost.com/software/asl-live-translator-rqekhp",
    "about": "The ASL Live Translator uses a webcam to capture American Sign Language (ASL) signs, which are then converted into live captions. This allows users to communicate seamlessly with individuals who are deaf or hard of hearing by translating ASL into text.",
    "github": "https://github.com/nicoleleehy1/asl-live-captions",
    "tools": [
      "javascript",
      "next.js",
      "react",
      "tailwind",
      "tensor"
    ]
  },
  {
    "name": "Stream",
    "link": "https://devpost.com/software/f-l0643e",
    "about": "Stream is an AI agent that empowers males to improve their sperm health. Users upload a video of their sperm, which undergoes a YOLO model to identify sperm in different frames and gather their average sperm count and sperm motility score. The AI agent then users their sperm metrics to provide personalized recommendations and award them with NFTs (bronze, silver, gold) based on their sperm health. Users strive to earn the Gold NFT to wear as a badge of honour of their health.",
    "github": "http://github.com/friendly304010/sperm",
    "tools": [
      "eigenlayer",
      "hardhat",
      "opacity",
      "react",
      "solidity",
      "typescript"
    ]
  },
  {
    "name": "Vuzz",
    "link": "https://devpost.com/software/vuzz",
    "about": "Vuzz is a dynamic platform designed to connect volunteers with meaningful opportunities in an engaging and interactive way. Through a swipe-based interface, users can effortlessly browse and select volunteering events that align with their interests.",
    "github": "https://github.com/foxboxxx/treehacks25/tree/7am-cut",
    "tools": [
      "firestore",
      "gcloud",
      "react-native",
      "typescript"
    ]
  },
  {
    "name": "Posthuman",
    "link": "https://devpost.com/software/posthuman",
    "about": "Posthuman is an AI system designed to manage family interactions, digital assets, and facilitate posthumous account execution, prioritizing data privacy through local storage. Utilizing technologies like Mistral AI, ElevenLabs, and Luma, it creates personalized interactions, generates future event messages with deepfake video and AI audio, and memorializes online presences. The system integrates blockchain via EigenLayer for secure transactions and portfolio management, automating tasks like subscription cancellation and account deletion. It analyzes data from various sources—text, cloud accounts, and financial records—to proactively manage assets and execute pre-defined instructions upon a designated trigger.",
    "github": "https://github.com/r-agni/posthuman",
    "tools": [
      "docker",
      "eigenlayer",
      "elastic",
      "elevenlabs",
      "hardhat",
      "infura",
      "luma",
      "mistral",
      "musetalk",
      "next.js",
      "ollama",
      "scrapybara",
      "vercel"
    ]
  },
  {
    "name": "LeXcel",
    "link": "https://devpost.com/software/lexcel",
    "about": "LeXcel is an AI-powered add-on that enhances traditional spreadsheets by:",
    "github": "https://github.com/liunicholas/LeXcel",
    "tools": [
      "cursor",
      "googlescript",
      "html",
      "javascript",
      "openai",
      "spreadsheetapi",
      "windsurf"
    ]
  },
  {
    "name": "Sventos",
    "link": "https://devpost.com/software/sventos",
    "about": "Sventos is built on the Zoom Video SDK Next.js template, which allows 1-1 communication using Zoom's APIs. I then extended this to support multiple users, and most importantly, screensharing, making up the key elements of virtual school. Sventos gives users fine control over what they view from meetings/presentations/webinars by being able to move and resize their frames, allowing users quality of life and educators/content-creators the ability to create immersive education/other immersive experiences.",
    "github": "https://github.com/aksharye/sventos",
    "tools": [
      "next.js",
      "node.js",
      "tailwind"
    ]
  },
  {
    "name": "Pitcher",
    "link": "https://devpost.com/software/pitcher-6v28a3",
    "about": "Given access to your code base, documentation materials, and a prompt. Pitcher can create a powerpoint presentation that contains relevant images/information from documentation you gave and also custom data visualization charts. Pitcher allows you to showcasing your project in whichever angle you want. Moreover, Pitcher will present to you in its own voice the project that you included. When interrupted verbally Pitcher will stop to answer questions while simultaneously generating more slides to answer your question as well as directly citing information from the codebase/documentation.\n\nKey features: generates slides from codebase and documents generates and includes contextual images and data visualizations auto-presents with automatic voiceover Allows user to interrupt and ask questions Generates additional slides for clarification after questions are asked.",
    "github": "https://github.com/KevinZWong/Pitcher",
    "tools": [
      "google",
      "nextjs",
      "openai",
      "python",
      "sonar",
      "typescript",
      "vectordb"
    ]
  },
  {
    "name": "Russel HomeBot",
    "link": "https://devpost.com/software/autonomous-robot-2a9c3r",
    "about": "Our autonomous robot is designed to bring independence back to those who need it most. It can receive voice commands from the user, locate an item, move to it, pick it up, and bring it back to the user. Our robot is also equipped with the ability to climb stairs, making it a versatile helper in various environments.",
    "github": "https://github.com/KshitijGoyal2022",
    "tools": [
      "arduino",
      "cad",
      "jetson-nano",
      "python",
      "ros2"
    ]
  },
  {
    "name": "MUSES",
    "link": "https://devpost.com/software/muses-d2xfrt",
    "about": "Our app will first display a tailored feed of music recommendations. They may choose to like, save, or scroll past each piece of music. The app will process data from likes, saves, and retention in a cosine similarity algorithm to determine musical repertoire recommendations for the user to practice and play.",
    "github": "https://github.com/Hecate946/Muses",
    "tools": [
      "flask",
      "flutter",
      "flutterflow",
      "openai",
      "python",
      "shell",
      "sql"
    ]
  },
  {
    "name": "VisionMate",
    "link": "https://devpost.com/software/hachi",
    "about": "Walking around within a bustling surrounding is typically dangerous for a person that is visually impaired, sometimes even for those that are not. But with this innovative mobile application, users can take photos of their surroundings with their phone, which are then processed with image recognition and depth estimation algorithms to identify obstacles and provide personalized and quantified safety suggestions from LLMs for blind users to travel within their surrounding environment.",
    "github": "https://github.com/lisere5/blindNavigation",
    "tools": [
      "dart",
      "depth-anything2",
      "elevenlabs",
      "fastapi",
      "firebase",
      "flutterflow",
      "langchain",
      "ngrok",
      "python",
      "pytorch",
      "segment-anything",
      "whisperapi"
    ]
  },
  {
    "name": "x-rAI",
    "link": "https://devpost.com/software/x-rai",
    "about": "x-rAI is an AI inference system that uses a Mixture of Experts approach combined with adaptive learning to optimize processing at the token level. It dynamically allocates resources, ensuring efficient computation without compromising accuracy. Our system also employs an auxiliary load balancer and caches at the expert cluster level to accelerate inference speed. This results in faster, more reliable, and scalable AI decision-making.\n\nOne of the most powerful applications of x-rAI is in accelerating software development cycles. Traditionally, teams spend weeks or even months defining Agile and Scrum stories, mapping out processes, and planning ceremonies. With x-rAI, we can bring this down to minutes by automatically generating Agile story templates, defining sprint goals, and optimizing backlog grooming based on past project data. Our AI system intelligently understands team dynamics, past velocity, and project goals to automate the planning phase, allowing developers to focus on execution rather than time-consuming administrative tasks.",
    "github": "https://github.com/rkat7/xAI-MoE",
    "tools": [
      "docker",
      "elasticsearch",
      "excel",
      "langchain",
      "llama",
      "mistral",
      "openai",
      "python",
      "spreadsheet",
      "sqlite",
      "terra",
      "vectordb"
    ]
  },
  {
    "name": "Bob: The Agent Builder",
    "link": "https://devpost.com/software/bob-the-agent-builder",
    "about": "Bob, the agent builder, takes a single text prompt as input and then intelligently breaks it down into the sub-tasks that need to be solved to complete the whole solution. The interface is familiar with blocks and connecting edges but now the entire graph is automatically generated and the blocks and edges can be any agentic workflow, as simple as code generation or LLM reasoning or as complex as computer use.\n\nA global planning agent chooses the best tools for each subtask by factoring in the demands of efficiency, nature of the subtask and input and output requirements. The entire agentic workflow is generated hierarchically with checking at each stage to ensure consistency and logical soundness. You just tell it what to do and it designs the best way to do it.",
    "github": "https://github.com/pringlesinghal/bob-the-builder",
    "tools": [
      "agents",
      "flask",
      "gemini",
      "langchain",
      "openai",
      "perplexity",
      "python",
      "react",
      "react-flow",
      "scrapybara"
    ]
  },
  {
    "name": "Eco Field",
    "link": "https://devpost.com/software/eco-field",
    "about": "Eco Field is a web-based platform that integrates a CrunchFlow-based geochemical model. Users enter feedstock types, soil composition, and application rates to estimate carbon sequestration potential. The tool then provides cost and revenue calculations, including carbon credit earnings, and shows breakeven metrics without requiring any specialized background in Fortran or deep geochemistry.",
    "github": "https://github.com/miguel-merlin/Carbon-Factibility-Chatbot,https://github.com/nicohenning/treehacks25,https://github.com/Aveeyy/carbon-farm-factory",
    "tools": [
      "langchain",
      "python",
      "react"
    ]
  },
  {
    "name": "Macro - Swarm of Verifiable Agents for Portfolio Management",
    "link": "https://devpost.com/software/macro-swarm-of-verifiable-agents-for-portfolio-management",
    "about": "Macro empowers anyone to:",
    "github": "https://github.com/shrithan1/macro",
    "tools": [
      "bash",
      "coinbase-agentkit",
      "coinbasesdk",
      "eigenlayer",
      "eigenlayeravs",
      "hardhat",
      "javascript",
      "nextjs",
      "node.js",
      "python",
      "react",
      "rust",
      "shadcn",
      "solidity",
      "typescript",
      "v0",
      "vercel"
    ]
  },
  {
    "name": "Memody",
    "link": "https://devpost.com/software/memody",
    "about": "Memody transforms the reading experience by creating a synchronized audio-visual experience:",
    "github": "https://github.com/Axelmannen/memody",
    "tools": [
      "ai-music-generation",
      "chrome",
      "javascript",
      "llm",
      "perplexity",
      "windsurf"
    ]
  },
  {
    "name": "VShop AI",
    "link": "https://devpost.com/software/vshop-ai",
    "about": "VShop AI is a voice-first, AI shopping agent. You talk to it, and it:",
    "github": null,
    "tools": [
      "eleven-labs",
      "eoracle.io-avs",
      "exa.ai",
      "gpt-4o",
      "json",
      "next.js",
      "rainbow-kit",
      "ryepay",
      "typescript",
      "wagmi"
    ]
  },
  {
    "name": "Axon",
    "link": "https://devpost.com/software/axios",
    "about": "Axon creates an all-in-one customizable newsletter and podcast that you receive each morning. It includes fact-checking features and research on topics of interest through a deep-research interface.",
    "github": "https://github.com/orgs/Palantuah/repositories",
    "tools": [
      "html/css",
      "python",
      "sql",
      "typescript"
    ]
  },
  {
    "name": "FlowScope:The Agentic Simulator for Predictive Flow Dynamics",
    "link": "https://devpost.com/software/flowscope-global-dynamics-visualizer",
    "about": "Imagine a world where transportation disruptions, refugee movements, and logistical challenges are no longer unpredictable mysteries. Introducing FlowScope --- your command center for global flows, an AI agent powered platform that forecasts, simulates, and visualizes dynamic movement patterns in real-time.\n\nIn this demo, we focus on marine transportation, showing how FlowScope empowers decision-makers to anticipate weather disruptions, geopolitical tensions, and operational bottlenecks. Our platform isn't limited to one domain; it's designed to adapt and scale across industries, from aviation to humanitarian logistics.",
    "github": "https://github.com/HowardHuang1/TreeHacks2025",
    "tools": [
      "fast-api",
      "langchain",
      "openai-api",
      "perplexity-search",
      "python",
      "react"
    ]
  },
  {
    "name": "dAIos",
    "link": "https://devpost.com/software/daios",
    "about": "DAIOS is a new web3 platform combining decentralized autonomous organizations (DAOs) with AI capabilities. Built using the T3 Stack and Ethereum, it offers features like smart contract management, an integrated AI chat system powered by OpenAI, and secure wallet-based authentication via Web3Modal. The project utilizes Next.js 15, Tailwind CSS, and TypeScript for a modern user interface. Development involves utilizing Foundry for smart contract development, with a focus on type safety and a streamlined workflow. Contributors are encouraged to fork the repository and follow the provided setup and contribution guidelines.",
    "github": "https://github.com/rohan-patra/daios",
    "tools": [
      "agent",
      "avs",
      "blockchain",
      "contracts",
      "eigenlayer",
      "etherscan",
      "fastapi",
      "foundry",
      "langchain",
      "next.js",
      "openai",
      "shad-cn",
      "trpc",
      "typescript",
      "v0",
      "web3"
    ]
  },
  {
    "name": "QuickQuack: The Ultimate Exam Grading Tool",
    "link": "https://devpost.com/software/quick-quack",
    "about": "QuickQuack is an AI-powered grading application that extracts submitted handwritten code and evaluates them against user-inputted test cases and grading rubrics. Here’s what it does:",
    "github": null,
    "tools": [
      "flutterflow",
      "gemini",
      "jdoodle",
      "json",
      "openai",
      "python"
    ]
  },
  {
    "name": "Green Growth",
    "link": "https://devpost.com/software/green-growth",
    "about": "Green Growth predicts the next big thing in sustainability to support a just transition. Our platform analyzes a novel dataset of clean energy sector trends to:",
    "github": "https://github.com/night-pianist/treehacks",
    "tools": [
      "colab",
      "flutterflow",
      "numpy",
      "openai",
      "pandas",
      "perplexity",
      "python",
      "scrapy",
      "sheets",
      "windsurf"
    ]
  },
  {
    "name": "WatchTower",
    "link": "https://devpost.com/software/watchtower-fulnqt",
    "about": "Similar to Tesla's dashboard, our product provides a depth map to give pilots a stronger sense of spatial awareness. Our product also gives recommendations on actions to take next for pilots to avoid potential collisions.",
    "github": "https://github.com/hpuppala26/TreeHacks2025/tree/main",
    "tools": [
      "flask",
      "machine-learning",
      "matplot",
      "midas",
      "python",
      "yolo"
    ]
  },
  {
    "name": "Theia",
    "link": "https://devpost.com/software/theia-p0mces",
    "about": "Theia is a project utilizing an ESP32 and machine learning to achieve “X-ray vision” through real-time presence detection and location estimation. It processes raw WiFi CSI data using a CNN with a multi-task architecture. The system preprocesses CSI signals, trains a dual-task model – one for presence detection and one for 2D coordinate location – and provides visualization tools for training and validation.  The project’s core functionality involves collecting and processing CSI data for simultaneous training and deployment of the model.",
    "github": "https://github.com/Timothy2105/theia",
    "tools": [
      "c",
      "c#",
      "c++",
      "cuda",
      "esp32",
      "jetsen",
      "linux",
      "python",
      "tensorflow",
      "vr"
    ]
  },
  {
    "name": "EverCare",
    "link": "https://devpost.com/software/wellnest-a32yt4",
    "about": "Users can describe their symptoms to a conversational AI agent, which then processes and delivers personalized responses based on a user’s background information and previous entries. These responses help the user better understand patterns in their health and flag issues that may require a visit to a healthcare provider. The responses are converted to speech using text-to-speech software in the backend, allowing users to hear them aloud. Users can access their previous conversations with the AI agent, allowing them to review past discussions and track their symptoms over time.",
    "github": "https://github.com/ksantoso2/EverCare",
    "tools": [
      "elevenlabs",
      "flask",
      "javascript",
      "openai",
      "perplexity",
      "python",
      "react"
    ]
  },
  {
    "name": "Clampsai",
    "link": "https://devpost.com/software/clampsai",
    "about": "ClampsAI is a real-time surveillance system that:",
    "github": "https://github.com/agamg/treehacks-clampsai",
    "tools": [
      "eleven-labs",
      "fastapi",
      "flask",
      "gemini",
      "google",
      "html",
      "javascript",
      "twilio"
    ]
  },
  {
    "name": "prototyp3d",
    "link": "https://devpost.com/software/prototyp3d-vc96d5",
    "about": "Prototyp3D enables anyone—developers, designers, educators, and entrepreneurs—to bring their 3D and VR ideas to life instantly. Users simply describe their vision in plain text, and our AI Agents go through an optimized pipeline to generate functional 3D/VR code, while rendering the results step by step for the user to interact with. It’s like having a virtual engineering team that plans, builds, tests, and refines your prototype—all without requiring coding skills.",
    "github": "https://github.com/miyaliu627/prototyp3d",
    "tools": [
      "anthropic",
      "bash",
      "css",
      "html",
      "javascript",
      "openai",
      "python",
      "react",
      "scrapybara",
      "ubuntu",
      "vm"
    ]
  },
  {
    "name": "KERneL",
    "link": "https://devpost.com/software/kernel-ls5pqa",
    "about": "KERneL is an AI-powered kernel generation tool that takes high-level code descriptions and transforms them into optimized CUDA kernels. By leveraging large language models (LLMs), KERneL automates the process of writing efficient GPU code, allowing developers to: ✅ Generate CUDA kernels from simple prompts ✅ Optimize performance with AI-assisted tuning ✅ Reduce the learning curve for GPU acceleration\n\nWith KERneL, more developers can tap into GPU computing for AI, graphics, and scientific simulations effortlessly.",
    "github": "https://github.com/radi-cho/KERneL",
    "tools": [
      "c++",
      "cuda",
      "gpu",
      "kernel",
      "n-grok",
      "nvidia",
      "python",
      "reasoning",
      "streamlit"
    ]
  },
  {
    "name": "Haven",
    "link": "https://devpost.com/software/haven-6nfwr9",
    "about": "Haven is a smart garment designed to detect and alleviate anxiety in real time. Using data from pre-your own wearables and biometric sensors embedded within the garment, it continuously monitors physiological indicators like heart rate variability, skin temperature, and breathing patterns. When it detects signs of anxiety—such as an elevated heart rate or erratic breathing—Haven automatically activates its built-in therapeutic mechanisms. These include deep pressure stimulation, mimicking the calming effect of a weighted blanket, and vibration therapy, which provides soothing rhythmic pulses to help regulate stress responses. All of this happens seamlessly, without the need for user intervention, allowing wearers to manage their anxiety discreetly and effortlessly.",
    "github": "https://github.com/fukaikeda/treehacks2025",
    "tools": [
      "3dprinting",
      "arduino",
      "autodesk-fusion-360",
      "c++",
      "firebase",
      "javascript",
      "machine-learning",
      "mongodb",
      "motors",
      "node.js",
      "numpy",
      "pandas",
      "python",
      "pytorch",
      "scikit-learn",
      "sewing",
      "swift",
      "tensorflow",
      "terraapi",
      "xcode"
    ]
  },
  {
    "name": "QPQP: Flexible Exchange Platform",
    "link": "https://devpost.com/software/qpqp-flexible-exchange-platform",
    "about": "QPQP is (for now) a web app that attempts to simplify the user flow as much as possible. Once someone logs in, they are presented with 3 buttons: one to set up an offer, one to set a request, and one to view their history of offers and requests. The current version of the design includes just a bare minimum number of variables to fill out in each of the first two cases: a title for searching and bookkeeping, a distance metric to quantitatively gauge an individual's interest in traveling for the good or service, a category selection menu for filtering, and a description field. While most forms tend to leave this part optional, I intended for it to be required because it is the user's opportunity to tell a story about what they're offering, or if they're not feeling particularly talkative, they can opt to say something more light-hearted that can maybe brighten someone else's day. If an offer is submitted, it goes immediately into the database, and if a request is submitted, it immediately returns a select few items from the database that may be of interest to the user.\n\nHowever, the matching process (even at this early stage) is twofold: first, a pretrained word2vec mapping is used on the delimiter-tokenized strings in the title and description fields, and second, the results are fed into a cosine similarity matrix constructor that finally generates optimal rankings based on relevance, then distance. These two slots could realistically have used any word embedding model and any similarity metric, respectively, because the end goal is to fine-tune a pipeline that is most agreeable with the user's transaction history, which can be viewed in their profile along with the transaction statuses. Once a user finds a satisfactory request result, they can choose to directly message the provider. In the best case scenario, this would result in a mutually beneficial trade sans official payment (and the various hurdles associated with that), but even if not, the chain of benefactors can extend through both parties so that it may later be possible to set up a three-or-more-way exchange.",
    "github": "https://github.com/kl31415/QPQP",
    "tools": [
      "anthropic",
      "cosine-similarity",
      "deepseek",
      "firebase",
      "javascript",
      "mongodb",
      "natural-language-processing",
      "node.js",
      "openai",
      "python",
      "shadcn",
      "tailwindcss",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "NeuroParallel.ai",
    "link": "https://devpost.com/software/neuroparallel-ai",
    "about": "NeuroParallel.ai is an advanced AI research assistant that transforms how researchers interact with academic papers and implement new technologies. It:\n\nAnalyzes Research Trends: Processes and summarizes recent AI research papers, identifying emerging trends and breakthrough technologies Generates Implementation Code: Converts theoretical concepts into practical code implementations, complete with documentation and best practices Decomposes Complex Tasks: Automatically breaks down research queries into manageable subtasks and processes them in parallel Provides Citation-Backed Insights: Delivers comprehensive analysis with proper citations to source materials Offers Real-Time Interaction: Streams responses character-by-character with syntax-highlighted code blocks for immediate feedback",
    "github": null,
    "tools": [
      "chromadb",
      "css3",
      "flask",
      "html5",
      "javascript",
      "langchain",
      "openai",
      "perplexity",
      "python",
      "sonar",
      "windsurf"
    ]
  },
  {
    "name": "ModifAI",
    "link": "https://devpost.com/software/modifai",
    "about": "Modif.AI is revolutionizing web accessibility by using real-time AI-driven code generation to modify websites dynamically, ensuring that users get an experience tailored to their individual needs. Instead of relying on static accessibility settings or waiting for developers to build accessibility features into websites, Modif.AI allows users to instantly adjust websites on their own terms—just by making a request.\n\nAt its core, Modif.AI learns and adapts over time. By analyzing the changes users request—such as increasing font sizes, enabling high-contrast themes, or restructuring page elements—it refines its ability to predict and automate future accessibility needs. This means that as more people use the platform, Modif.AI becomes smarter, automatically applying accessibility optimizations based on past interactions. If a user frequently changes a particular website layout or color scheme, the system remembers and applies similar modifications the next time they visit a comparable site, eliminating the need for constant adjustments.\n\nKey Features of Modif.AI -Instant Accessibility Adjustments: Users can request larger text, high-contrast themes, text-to-speech functionality, or hands-free navigation in real-time, and Modif.AI applies the modifications instantly. -Dynamic Code Generation: Instead of relying on preset accessibility tools, Modif.AI analyzes website structures and generates custom code on the fly, ensuring that even poorly designed or inaccessible websites can be transformed. -Hands-Free Navigation: Users with motor impairments or mobility challenges can navigate websites using voice commands, allowing them to click buttons, open links, and interact with elements without needing a mouse or keyboard. -Personalized Learning & Automation: Modif.AI remembers user preferences and applies similar accessibility modifications to related websites, ensuring a consistent and adaptive experience. -Continuous Improvement: As more users interact with the platform, it learns which modifications are most effective, improving accessibility solutions for all users over time.\n\nBy combining real-time AI-powered code generation, predictive learning, and adaptive automation, Modif.AI is breaking down barriers and making the internet more accessible for everyone—one modification at a time.",
    "github": "https://github.com/JCoonradt/Modif.AI/tree/main",
    "tools": [
      "dain",
      "electron",
      "eleven-labs",
      "html",
      "intersystems-vector-database",
      "javascript",
      "mistral",
      "python",
      "scrapybara",
      "windsurf"
    ]
  },
  {
    "name": "MedMentor",
    "link": "https://devpost.com/software/medmentor-o7lh9r",
    "about": "This Health Companion Assistant, developed for TreeHacks, aims to improve patient care by recording, transcribing, and summarizing doctor consultations, initially focused on diabetes. The app utilizes AI—including OpenAI and ElevenLabs—to automatically transcribe audio, generate actionable insights, and provide context-aware chatbot support. Patients securely register and access personalized information. Future development includes support for other chronic diseases, advanced symptom analysis, and a broader range of health management features, utilizing technologies like Flask, Firebase, and Celery for robust functionality and scalability.",
    "github": "https://github.com/nishashastry/treehacks2025",
    "tools": [
      "css",
      "elevenlabs",
      "firebase",
      "next.js",
      "openai",
      "perplexity",
      "python",
      "react"
    ]
  },
  {
    "name": "TreeCycle",
    "link": "https://devpost.com/software/treecycle-umd2yx",
    "about": "Our product sets up an environment for people to explore how to discard their waste through two methods: \"practice\" and \"clean mess\". For the practice method, we created a welcoming environment that allows users to interact with the world around them and practice discarding the various articles of waste scattered across the ground, updating the dynamic world around them to reflect the effects that their choices would have on the environment. An additional feature that is extremely useful is the clean mess method that is built from a mobile application where you are able to take a picture of articles of waste that you want to clean up, and a model that we've trained identifies what waste they are, and populates the VR game with those exact waste articles so you can practice cleaning up your mess in a fun environment, while simultaneously learning how to actually clean up your mess.",
    "github": "https://github.com/FeoluK/Treehacks-Sustainability-Project",
    "tools": [
      "augmented-reality",
      "brev",
      "fastapi",
      "python",
      "reality-kit",
      "swift",
      "vision-pro",
      "yolo"
    ]
  },
  {
    "name": "AfroVision",
    "link": "https://devpost.com/software/afrovision",
    "about": "AfroVision enhances virtual background rendering by improving the segmentation of curly, coily, and afro-textured hair. We implemented DeepLabV3 with ResNet101 to segment hair while testing how different models handle diverse textures. Our system processes images, generates segmentation masks, and seamlessly blends the subject with a virtual background.",
    "github": "https://github.com/Pamelachristina/AfroVision",
    "tools": [
      "colab",
      "deeplabv3-resnet101",
      "google",
      "matplotlib",
      "opencv",
      "pil",
      "python",
      "pytorch"
    ]
  },
  {
    "name": "NutriVision",
    "link": "https://devpost.com/software/nutrivision-msxjyl",
    "about": "This project, NurtiVision, aims to revolutionize calorie tracking by deploying an AI-powered VR application within Ray-Ban Meta Glasses. Recognizing the struggle of manual calorie counting, the system automatically detects food intake, logging calories, protein, fat, carbs, and potassium in real-time. Users input their weight loss goals, and the app provides live notifications when exceeding daily limits, displaying overall trends. Utilizing YOLOv11 object detection and OpenAI API integration, the application seeks to provide an effortless and proactive approach to achieving dietary goals, anticipating user behavior and offering immediate guidance.",
    "github": "https://github.com/enkhbold470/nutrivision",
    "tools": [
      "flask",
      "metaquest",
      "perplexity",
      "postgresql",
      "vanilajs",
      "yolo"
    ]
  },
  {
    "name": "SoleMate",
    "link": "https://devpost.com/software/solemate-9jmhuf",
    "about": "SoleMate is a mobile app that leverages LiDAR technology on iPhones to scan a user’s feet in 3D and generate a custom-fitted insole. Using this 3D scan, we create a perfectly contoured, 3D-printable shoe insert tailored to the user’s foot shape. Users can then order their custom inserts or print them at home with a 3D printer.",
    "github": "https://github.com/TaylorT52/solemate",
    "tools": [
      "arkit",
      "gcp",
      "lidar",
      "open3d",
      "swift",
      "swiftui",
      "trimesh"
    ]
  },
  {
    "name": "CARBONLE",
    "link": "https://devpost.com/software/carbonle",
    "about": "CARBONLE is a geographical Wordle-like guessing game where you have up to 6 guesses to identify the 'target country'. Our application leverages real-world carbon emissions data and displays them with Treemaps (like the square graphs that Stock changes are displayed on!).\n\nHow It Works:",
    "github": "https://github.com/bdok23/treehacks2025/",
    "tools": [
      "node.js",
      "openai",
      "react",
      "rechart"
    ]
  },
  {
    "name": "CareNest",
    "link": "https://devpost.com/software/carenest-hkd2q3",
    "about": "Carenest is an AI-powered caregiving companion that provides peace of mind to families while improving the well-being of dependents. Our platform combines AI avatars, smart wearables, and intelligent video monitoring to create a safe and connected home environment.\n\n🔹 Tackling Loneliness: Dependents often struggle with isolation, which affects their emotional well-being. With our AI-powered companion, they can engage in meaningful conversations anytime, helping them feel connected and supported.\n\n🔹 Wearables to the Rescue: Health monitoring is critical for dependents who require constant care. Carenest integrates with wearable devices to track vital signs and detect anomalies, ensuring caregivers are alerted to potential health concerns in real time.\n\n🔹 Mishap Prevention: Accidents can happen when no one is watching. Our AI video agent continuously monitors for falls, unusual movements, or emergencies, instantly notifying caregivers so they can take immediate action.\n\nCarenest empowers caregivers with the tools to ensure their loved ones are safe, healthy, and never alone.",
    "github": "https://github.com/meetp06/CareNest2025",
    "tools": [
      "elasticsearch",
      "elevenlabs",
      "flask",
      "flutterflow",
      "groq",
      "kibana",
      "mongod",
      "python",
      "react",
      "s3",
      "terraapi"
    ]
  },
  {
    "name": "Teacher.AI",
    "link": "https://devpost.com/software/teacher-ai-5sgld4",
    "about": "Key components of our hack include the NVIDIA Jetson Nano, Logitech web-camera and AI models like:",
    "github": null,
    "tools": [
      "css",
      "cuda",
      "elevenlabs",
      "google",
      "html",
      "javascript",
      "jetson",
      "jetson-nano",
      "kokoro",
      "llama",
      "nvidia",
      "openai",
      "opencv",
      "python",
      "raspberry-pi",
      "replit",
      "sql",
      "sqlite",
      "tailwind",
      "yolo"
    ]
  },
  {
    "name": "BackSeat_Driver",
    "link": "https://devpost.com/software/backseat_driver",
    "about": "Our project uses pre-trained models to extract from videos different traffic related data, building a scenario into text in which then we feed to a chatGPT api in order to determine a related question. Videos and multiple choice questions are given to us by Tesla.",
    "github": "https://github.com/LuisArizmendi13/TreeHacks2025",
    "tools": [
      "blip",
      "brev",
      "clip",
      "cuda",
      "jupyter",
      "nvida",
      "python",
      "roboflow",
      "yolo"
    ]
  },
  {
    "name": "Truth AI Agent",
    "link": "https://devpost.com/software/rhetai",
    "about": "Truth AI agents can be deployed on any social media platform. They are powered by autonomous and verifiable AI compute to deliver high quality, unbiased, untampered opinions. By using AI to analyze content, platforms can efficiently eliminate or demonetize content that doesn't meet criteria. Incorporating the AVS allows for transparency. Any user can view the prompt that was used to analyze the content. This ensures that platforms are not injecting their own biases into the AI.",
    "github": "https://github.com/owenkrause/truth-ai",
    "tools": [
      "avs",
      "eigenlayer",
      "express.js",
      "next.js",
      "opacity",
      "openai",
      "tailwindcss",
      "typescript"
    ]
  },
  {
    "name": "HeartHack",
    "link": "https://devpost.com/software/hearthack",
    "about": "HeartHack is an AI-powered tool that automates swiping on dating apps based on your personal preferences. First, it asks you a few key questions to understand your ideal match and builds a personalized profile. From there, it scans Tinder profiles from screenshots, using LLM (currently Gemini, but this could be easily changed) to analyze the bios and photos of potential matches. If a profile aligns with your preferences, it swipes right; if it detects dealbreakers, it swipes left.",
    "github": "https://github.com/avah1026/treehacks-2025",
    "tools": [
      "css",
      "gemini",
      "html",
      "javascript",
      "kotlin",
      "maestro",
      "react"
    ]
  },
  {
    "name": "AeroForge 3D",
    "link": "https://devpost.com/software/aeroforge-3d",
    "about": "AeroForge 3D is an AI-powered system that transforms legacy 2D blueprints into photorealistic, engineering-accurate 3D models in seconds.\n\n🔹 Defense & Aerospace-Grade Precision → Our system processes military blueprints and ensures compliance with aerospace manufacturing standards (MIL-STD-31000).\n\n🔹 Seamless AI-Powered 2D-to-3D Conversion → Extracts key technical details from PDFs and reconstructs them into high-fidelity, immersive 3D renderings.\n\n🔹 Rapid Prototyping & Upgrades → Engineers can visualize multiple design variations instantly, leading to faster, more informed decision-making.\n\n🔹 Mission-Readiness at Scale → Instead of weeks of painstaking CAD modeling, our AI does it in seconds—allowing defense contractors to be proactive, not reactive.\n\nThis is more than just automation. It’s a new way to engineer, visualize, and modernize aerospace technology.",
    "github": "https://github.com/ShreyesS/AeroForge3D",
    "tools": [
      "css",
      "dreammachine",
      "flask",
      "github",
      "gpt4o",
      "gunicorn",
      "html",
      "javascript",
      "json",
      "luma",
      "openai",
      "perplexity",
      "python",
      "ray-2",
      "sonar",
      "sora"
    ]
  },
  {
    "name": "engagED",
    "link": "https://devpost.com/software/teacher-teacher",
    "about": "engagED simulates a classroom environment where teachers interact with AI-powered student personalities, each with unique behaviors, engagement levels, and challenges. The platform allows educators to practice managing real-world classroom dynamics—whether it’s handling a disruptive student, encouraging a quiet learner to participate, or maintaining engagement during a lesson.\n\nengagED responds to natural teacher interactions in a virtual classroom setting, adjusting student behaviors based on teaching strategies. Just like in a real class, students may ask unexpected questions, lose focus, or react differently depending on the teacher’s approach. At the end of each session, engagED provides a performance dashboard, offering insights into key performance metrics and providing feedback for improvement.",
    "github": "https://github.com/jasmine-dragons/engaged",
    "tools": [
      "elevenlabs",
      "groq",
      "javascript",
      "langchain",
      "mongodb",
      "next.js",
      "openai",
      "python",
      "react",
      "typescript",
      "whisper"
    ]
  },
  {
    "name": "AERO",
    "link": "https://devpost.com/software/aero-yu405v",
    "about": "AERO is more than just a chatbot—it’s an action-driven AI assistant that listens, understands, and executes commands instantly. Here’s what AERO can do:",
    "github": "https://github.com/TreeHacks25/AERO/tree/main",
    "tools": [
      ".exe",
      "bootstrap",
      "css",
      "gemini",
      "groq",
      "html",
      "javascript",
      "json",
      "openai",
      "parallel",
      "parallel-programming",
      "python",
      "stt",
      "threading",
      "tts",
      "vision",
      "zoom"
    ]
  },
  {
    "name": "Odin",
    "link": "https://devpost.com/software/odin-e3hd4w",
    "about": "From a single user-prompt and user-defined schema, our software will scrape the web in realtime and iteratively generate schema-defined row data. This could be anything from \"build a dataset of recent merges & acquisitions\" to \"build a dataset on popular podcasts across the United States in 2010s\".",
    "github": "https://github.com/taeyangcode/treehacks-25/invitations",
    "tools": [
      "deepseek",
      "flask",
      "groq",
      "python",
      "react",
      "restapi",
      "scrapybara",
      "supabase",
      "typerscript"
    ]
  },
  {
    "name": "Scrollarly",
    "link": "https://devpost.com/software/scrollarly",
    "about": "Scrollarly is a continuous-scrolling research discovery platform that applies the engagement mechanics of social media to academic literature. By integrating InterSystems IRIS Vector Search, it enables natural language-driven discovery, personalized recommendations, and multi-vector semantic retrieval, which makes sure that users find the most relevant research without reliance on rigid keyword matching. This platform reimagines research consumption and makes it intuitive and accessible to a broader audience.",
    "github": "https://github.com/reaganrazon/scrollarly",
    "tools": [
      "ai",
      "api",
      "css",
      "intersystems",
      "openai",
      "python",
      "react",
      "sql",
      "typescript",
      "vite"
    ]
  },
  {
    "name": "TalkTuah",
    "link": "https://devpost.com/software/talktuah",
    "about": "TreeHacks2 is a collaborative, open-source project focused on building a decentralized, privacy-preserving social media platform. It utilizes ActivityPub, a decentralized social networking protocol, to connect users and content across different services. The project aims to offer a more user-controlled and secure alternative to centralized social media. Key components include a Mastodon-compatible frontend and backend, allowing developers to easily integrate with existing ActivityPub networks. It’s a community-driven effort to foster a more open and resilient social web.",
    "github": "https://github.com/IbrahimKhanGH/TreeHacks2",
    "tools": [
      "blackhole",
      "elevenlabs",
      "groq",
      "meta",
      "openai",
      "opencv",
      "speechmatics"
    ]
  },
  {
    "name": "CogniSync",
    "link": "https://devpost.com/software/cognisync",
    "about": "This project develops a web application for cognitive health analysis utilizing speech, IMU sensor data, and interactive cognitive games. Built with Streamlit, it incorporates machine learning pipelines, sensor data visualization, and a performance tracker. The application analyzes speech features, processes IMU sensor data for movement analysis, and tracks game performance. Key components include `analyze_sensor_data.py`, `diagnostic_model.py`, and a `feature_extractor.py`. To run, clone the repository, install dependencies (Streamlit, Plotly, Transformers, Torch, NumPy), and execute `streamlit run demo.py`. Optionally, expose the app publicly using Ngrok for remote access.",
    "github": "https://github.com/Sanskriti-Slngh/CognitiveApp",
    "tools": [
      "html",
      "imu",
      "machine-learning",
      "numpy",
      "plotly",
      "python",
      "streamlit",
      "tcp/ip",
      "transformers"
    ]
  },
  {
    "name": "Odin AI",
    "link": "https://devpost.com/software/odin-ai-m5nw4d",
    "about": "Odin AI is a study tool inspired by Norse mythology, designed to enhance learning through visualization and analysis. It creates knowledge graphs comparing your notes with lecture recordings to identify missing topics and highlight connections between concepts. Utilizing a pipeline of algorithms and AI, Odin generates quiz questions tailored to your current understanding, aiming to optimize your study efficiency. To get started, install dependencies, configure API keys, and run the development server via `npm install` and `npm run dev`.",
    "github": "https://github.com/ML72/Odin-AI",
    "tools": [
      "material-ui",
      "openai",
      "react",
      "reagraph",
      "tesseract",
      "typescript",
      "whisper"
    ]
  },
  {
    "name": "IntelliCare",
    "link": "https://devpost.com/software/intellicare-hr3q2j",
    "about": "The “intelli-care” project leverages large language models and visual data to proactively prevent patient crises. It utilizes the OpenAI API to synthesize vital signs summaries for rapid alert and severity classification. Simultaneously, the project analyzes visual data – like facial drooping or nosebleeds – to identify potential crises before they occur. This combined approach aims to provide earlier warnings and improve patient outcomes through predictive analysis.",
    "github": "https://github.com/anakhag07/intelli-care",
    "tools": [
      "cursor",
      "lightgbm",
      "openai",
      "openface",
      "python",
      "streamlit",
      "vscode"
    ]
  },
  {
    "name": "TeslaQA",
    "link": "https://devpost.com/software/teslaqa",
    "about": "TeslaQA automatically analyzes traffic videos and answers questions about driver behavior, traffic rules, and road safety. By first converting video content into descriptive text using BLIP, and then leveraging ChatGPT for question-answering, our system provides detailed explanations of traffic scenarios.",
    "github": "https://github.com/HangLiu01/2025treehacks_tesla",
    "tools": [
      "api",
      "blip",
      "jupyternotebook",
      "openai",
      "python",
      "tesla",
      "vlm"
    ]
  },
  {
    "name": "cafe fra.me",
    "link": "https://devpost.com/software/cafe-fra-me",
    "about": "Cafa Fra.me is a two-part solution designed to revolutionize healthcare management:",
    "github": "https://github.com/jeofo/cafeframe",
    "tools": [
      "ethers.js",
      "gemini",
      "jina",
      "openai",
      "perplexity",
      "polygon",
      "python",
      "react-native",
      "solidity",
      "swift",
      "terra",
      "viem",
      "wagmi"
    ]
  },
  {
    "name": "Revi",
    "link": "https://devpost.com/software/revi",
    "about": "Revi is an AI-powered application that aggregates and generates reviews to assist users in making informed purchasing decisions quickly. To use it, you’ll need to create a virtual environment, install dependencies via `pip`, and configure environment variables with API keys from Google Cloud, OpenAI, Oxylabs, EnsembleData, and Perplexity.  The application is then run using `python app.py`, and accessed through a local web server at `http://localhost:5000`. Full functionality requires all specified API keys.",
    "github": "https://github.com/Bloomh/revi",
    "tools": [
      "api",
      "css",
      "flask",
      "html",
      "javascript",
      "openai",
      "python",
      "whisper"
    ]
  },
  {
    "name": "Stable-RL",
    "link": "https://devpost.com/software/stable-rl",
    "about": "Conformal Q-Learning enhances standard RL algorithms by introducing statistical confidence intervals around Q-value estimates. It ensures that:",
    "github": "https://github.com/khushgx/cql",
    "tools": [
      "d4rl",
      "gym",
      "mujoco",
      "pytorch",
      "rl",
      "tailwindcss",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "Mobius",
    "link": "https://devpost.com/software/mobius-e7jidz",
    "about": "Mobius is an agent-driven, fleet-ready automation platform that enables developers to:",
    "github": "https://github.com/Arihan10/Treehacks-Winners",
    "tools": [
      "adb",
      "android-studio",
      "fastapi",
      "langchain",
      "langgraph",
      "llama",
      "openai",
      "python",
      "websockets"
    ]
  },
  {
    "name": "VisionZ+",
    "link": "https://devpost.com/software/visionz",
    "about": "VisionZ+ is a first-of-its-kind data visualization and analysis platform that lets users analyze any dataset through a simple drag-and-drop interface. With our dataset assistant, you can simply ask questions about your data and let the AI find patterns and insights for you. The platform is powered by a Multi-Agent AI Architecture that processes data through multiple specialized agents - from initial analysis and orchestration to planning, execution via mini-agent swarms, and validation. This makes sophisticated data analysis accessible to anyone, regardless of their technical background. Whether you're a medical researcher analyzing patient data, a military strategist evaluating operations, a financial advisor tracking markets, or a small business owner understanding operations, VisionZ+ eliminates the need for a dedicated data science team - just ask questions and get insights.",
    "github": "https://github.com/AntoDono/visionzplus",
    "tools": [
      "express.js",
      "html",
      "mongodb",
      "nextjs",
      "open-ai-api",
      "react",
      "tailwindcss",
      "terra-api"
    ]
  },
  {
    "name": "Octavius",
    "link": "https://devpost.com/software/octavius",
    "about": "Octavius quickly detects injuries among soldiers in the battlefield and evaluates what next steps a combat medic should take. A robotic arm can also assist in common battlefield procedures like chest trauma and wound packing or simply holding instruments for medics. We showcase both these capabilities through abstract scenarios.\n\nDuring evacuation, automated voice calls can also coordinate efforts among multiple combat medics. And finally, combat medics may access the medical history of all soldiers to make fast and informed decisions.",
    "github": "https://github.com/treehacks-2025-octavius",
    "tools": [
      "apple-vision-pro",
      "elevenlabs",
      "intersystems",
      "jetson-nano",
      "nano-owl",
      "openai",
      "python",
      "robot-arm",
      "zoom"
    ]
  },
  {
    "name": "Bee Well",
    "link": "https://devpost.com/software/bee-well-03t1a9",
    "about": "Bee Well challenges you to guide a bee to a flower—all using head tilts!",
    "github": "https://github.com/lindaktong/treehacks",
    "tools": [
      "cmmotionmanager",
      "procreate",
      "swift",
      "xcode"
    ]
  },
  {
    "name": "StoryTime",
    "link": "https://devpost.com/software/storytime-zgml96",
    "about": "StoryTime generates custom, interactive storybooks based on a child’s profile and a lesson or theme chosen by the parent. It features AI-generated stories tailored to the child’s background and interests, and narrated audio to bring the stories to life. There are AI-generated animations for every page, making the experience more immersive. Our platform is also hands-free and accessible, with the capability to simply talk to the platform and watch your story unfold. StoryTime allows children to have their own personal library with engaging, educational books at their fingertips.",
    "github": "https://github.com/naishagarwal/treehacks-2025-personalized-storybook",
    "tools": [
      "luma",
      "openai",
      "python",
      "react"
    ]
  },
  {
    "name": "BuckyUp",
    "link": "https://devpost.com/software/bucky",
    "about": "Mental health triage needs to be faster, smarter, and more effective—especially in high-stakes environments like the military, where mental health is inextricably tied to performance. BuckyUp is an AI-driven solution that performs rapid psychological assessments in just five minutes. Pulling together real-time conversational AI (GPT-4o), computer vision (MediaPipe), and biometric data (Terra API), BuckyUp evaluates speech patterns during a classic SIGECAPS-based screening interview and measures blink rate and vitals to flag at-risk individuals dynamically. Why measure eye blinks and heart rate? Both have been shown to increase in clinically depressed patients (3, 4).\n\nBy overlaying these insights into a visual report, we empower healthcare professionals to make informed, data-backed decisions. BuckyUp also offers a guided meditation for interested users—empowering them to prioritize mental health.",
    "github": "https://github.com/bnatasha24/treehacks25",
    "tools": [
      "elevenlabs",
      "flask",
      "mediapipe",
      "next",
      "openai",
      "supabase",
      "terra"
    ]
  },
  {
    "name": "LLMaOS",
    "link": "https://devpost.com/software/llmaos",
    "about": "As an operating system, LLMaOS simplifies the way you interact with the computer. Below are some examples (non-exhaustive).\n\n(1) \"Play me the song Espresso\"",
    "github": "https://github.com/jianzhi-1/LLMaOS",
    "tools": [
      "asyncio",
      "gpt",
      "mistralai-pixtral",
      "nvidia-neva",
      "openai-realtime"
    ]
  },
  {
    "name": "TalkThru",
    "link": "https://devpost.com/software/talkthru",
    "about": "You provide a topic to the agent. You provide the agent a role.\n\nThe agent holds a conversation with you and summarizes what you should improve on at the end. It’s that easy.",
    "github": "https://github.com/Andrea-MiramonSerr/tree-hacks.git",
    "tools": [
      "aniportrait",
      "cuda",
      "elevenlabs",
      "flask",
      "html",
      "lumalabs",
      "perplexity",
      "python",
      "speech-recognition"
    ]
  },
  {
    "name": "Swiper, No Swiping!",
    "link": "https://devpost.com/software/swiper-no-swiping-qwjv28",
    "about": "The SNS device constantly monitors for movement. If it detects that it moved, ie someone has picked up your important belonging, it will buzz loudly and uncontrollably, frightening the culprit until they leave your bag alone. Not only that, but it will send you an email notification so you can come back to check on your belongings. What's more, you can access the web server to see the history of your device's movement. If it only moved for a brief few seconds, perhaps it was merely pushed - but if the convenient graph indicates that it moved for an extended period of time, you know someone is trying to steal your stuff.",
    "github": "https://github.com/Char787/swiper-no-swiping",
    "tools": [
      "arduino",
      "buzzer",
      "css",
      "esp8266",
      "html",
      "http",
      "javascript",
      "mpu6050",
      "php",
      "txt"
    ]
  },
  {
    "name": "CapyGuardian",
    "link": "https://devpost.com/software/capy-guardian",
    "about": "CapyGuardian is a wearable health monitoring system that continuously tracks vital metrics such as heart rate, user kinematics, location, and even provides a waist-level video feed. All this data is presented on an intuitive dashboard where an integrated agentic AI analyzes the information in real-time. For example, if the AI abnormal heart rate patterns, it promptly issues an alert for immediate intervention—vital for both the vulnerable and large, dynamic groups.\n\nThe dashboard has 4 primary sections: 1) The feed from the camera at waist-level 2) The kinematics of the user displayed on a skeleton (the skeleton moves with the user) 3) Heart rate data 4) Location on a map with friendlies (green dots) and hostiles (red dots) displayed\n\nExample Output from the CapyGuardian:\n\n####################### I've submitted an urgent alert through the logs system. Based on my analysis:",
    "github": "https://github.com/PatP15/TreeHacks2025",
    "tools": [
      "c++",
      "python"
    ]
  },
  {
    "name": "focusr ai",
    "link": "https://devpost.com/software/focusr-ai",
    "about": "Focusr.ai is a web application designed to improve student focus during lectures. It allows users to upload or record audio/video files, which are then analyzed using eye-tracking software (Google Gemini) to identify disengagement. The system leverages AI – OpenAI Whisper for transcription and Perplexity Sonar for summarization – to generate customized lecture summaries highlighting sections where the student lost focus.  A visual engagement chart displays trends over time. Built with React, Flask, and Tailwind CSS, Focusr.ai provides an interactive tool for students to understand and improve their learning habits. Future development includes live eye tracking and LMS integration.",
    "github": "https://github.com/isabellasocci/focusr-ai",
    "tools": [
      "api",
      "flask",
      "gemini",
      "javascript",
      "openai",
      "perplexity",
      "python",
      "react.js",
      "vercel"
    ]
  },
  {
    "name": "Honeycomb",
    "link": "https://devpost.com/software/coeus-pfvn7c",
    "about": "Honeycomb is a unified platform for experimenting with AI models, building sophisticated workflows, and seamlessly integrating data sources:",
    "github": "https://github.com/jasondu7297/honeycomb",
    "tools": [
      "codeium",
      "elasticsearch",
      "google",
      "langchain",
      "openai",
      "python",
      "react",
      "vectordb",
      "windsurf"
    ]
  },
  {
    "name": "EcoNomNom: Sustainability One Snap at a Time",
    "link": "https://devpost.com/software/economnom-di7lg6",
    "about": "EcoNomNom is your personalized AI-powered grocery shopping assistant. Simply snap a picture of the shelf, and EcoNomNom ranks products in the image based on farm-to-shelf sustainability metrics.\n\nFor each item on the shelf, our app extracts product details and provides easy-to-understand ratings on key sustainability factors, including carbon footprint, packaging waste, ingredient sourcing, animal welfare, harmful chemicals, palm oil content, and more. These factors are aggregated into our own sustainability rating called the GreenScore.\n\nYou can customize recommendations based on the sustainability metrics that matter most to you — whether that’s reducing emissions, supporting fair trade sourcing, or avoiding harmful additives. EcoNomNom also tracks your footprint over time, showing how much carbon emissions you’ve saved by making eco-friendly purchases. Every dollar you spend is a vote for the future you want. With EcoNomNom, you can vote for a greener planet — without sacrificing time, money, or taste.",
    "github": "https://github.com/Supernova-45/EcoNomNom/tree/code",
    "tools": [
      "dart",
      "docker",
      "fastapi",
      "firebase",
      "flutterflow",
      "intersystems",
      "openai",
      "python"
    ]
  },
  {
    "name": "JARVIS Health",
    "link": "https://devpost.com/software/jarvis-health",
    "about": "JARVIS Health aggregates real-time heart rate and exertion data from wearable devices using the Terra API, focusing on data from multiple soldiers rather than just individuals. This data is displayed on a dashboard that provides commanders with data-driven insights into soldiers' physical states, enabling more informed decisions. By tracking these vital metrics across a group, the system helps identify early signs of over-exhaustion, optimize training, and reduce injury risk, ensuring soldiers train smarter, not harder. Powered by OpenAI’s LLM, our system also analyzes aggregated data to make actionable recommendations, such as transferring load or suggesting breaks, to ensure that each soldier maintains optimal performance and well-being.",
    "github": "https://github.com/asaju67/JARVIS_Health/",
    "tools": [
      "firebase",
      "flutterflow",
      "llm",
      "openai",
      "terraapi"
    ]
  },
  {
    "name": "Myst",
    "link": "https://devpost.com/software/myst-p09ai2",
    "about": "We created a Chrome Extension that automatically captures screenshots of online activity upon tab changes and significant keystrokes and analyzes the content in real time, all while minimizing storage usage by updating a rolling classification vector instead of storing every screenshot. Using Vision-Language Models (VLMs), content classification, and sentiment analysis, we generate a numerical consumption vector that categorizes a user's browsing habits on progressive scales for various categories: motivational (generally optimistic vs. pessimistic content), educational (informative vs. brain rot content), political (conservative vs. liberal content), and economic (capitalist vs. social content), and whether or not the content is misinformation. Users are then given an easy to read summary of where their content consumption leans.\n\nBy continuously updating rather than storing every screenshot, our system provides real-time insights without unnecessary data overhead. These insights are displayed dynamically, allowing users to track shifts in their media consumption and even receive recommendations for broadening their exposure.",
    "github": "https://github.com/matthewjguck/myst",
    "tools": [
      "css",
      "flask",
      "html",
      "javascript",
      "lumalabs",
      "mistral-ai",
      "openai",
      "python"
    ]
  },
  {
    "name": "Morpheus Ray-Bans: Your ASL Teacher",
    "link": "https://devpost.com/software/morpheus-iq2g1y",
    "about": "Morpheus is like having a friendly ASL interpreter and teacher in your browser. It can:",
    "github": "https://github.com/stevensegawa/asl-recognition-web.git",
    "tools": [
      "css",
      "flask",
      "html",
      "mediapipe",
      "numpy",
      "openai",
      "opencv",
      "pillow",
      "pygame",
      "python",
      "rayban-metas",
      "scikit-learn"
    ]
  },
  {
    "name": "LogFlowAI",
    "link": "https://devpost.com/software/creatorai",
    "about": "LogFlowAI is an end-to-end solution designed to modernize log analysis and system monitoring by combining automation with state-of-the-art AI. Key capabilities include:",
    "github": "https://github.com/DhyeyMavani2003/logflowai",
    "tools": [
      "anthropic-claude",
      "brev",
      "coveralls",
      "cuda",
      "django",
      "docker",
      "fast-api",
      "github-actions",
      "iris-vectorsearch-intersystems",
      "javascript",
      "langchain",
      "langgraph",
      "makefile",
      "ngrok",
      "numpy",
      "nvidia",
      "open-ai",
      "pandas",
      "perplexity",
      "pytest",
      "python",
      "pytorch",
      "scrapybara",
      "sphinx",
      "sqlite"
    ]
  },
  {
    "name": "Snap Chef",
    "link": "https://devpost.com/software/snap-chef-bfwep7",
    "about": "Snap chef just requires a picture of your fridge, either taken live or previously taken and uploaded. With this, it is able to use Google Gemini to parse the image and create delicious recipe ideas with the data and other parameters specified by the user.",
    "github": "https://github.com/ryan-tock/snap-chef",
    "tools": [
      "expo.io",
      "flask",
      "gemini",
      "git",
      "github",
      "google-generative-ai-api",
      "python",
      "react-native"
    ]
  },
  {
    "name": "Eduverse",
    "link": "https://devpost.com/software/eduverse-nzuaqj",
    "about": "Eduverse enhances learning with AI-powered assistance for note-taking and interactive studying:",
    "github": "https://github.com/pollyliu1/EDUVerse",
    "tools": [
      "elevenlabs",
      "groq",
      "meta",
      "node.js",
      "oculus",
      "openai",
      "python",
      "quest",
      "three.js"
    ]
  },
  {
    "name": "Orbit Cola",
    "link": "https://devpost.com/software/orbit-cola",
    "about": "Orbit Cola pulls data from the United States Space Command's \"Space-Track\" database, and uses advanced physics simulations to project the satellite trajectories forward in time in order to compute collision likelihood between any two satellites. Our web-based tool visualizes satellite trajectories and depicts collision risk for satellite operators to assess how to best mitigate risk at low costs.\n\nMore specifically, our pipeline gathers Two-Line Element sets from Space-Track [1] and propagates them using an orbit propagator called SGP4 [2]. It then stores this data in an SQL database hosted by Python Anywhere. From here, the pipeline uses the data to investigate potential collision risks and stores those (along with their collision probabilities) in the database as well.\n\nOrbit Cola's website contains many tools useful for satellite operators to look into potential conjunction events, future launches to watch out for, and where current satellites are in space.",
    "github": "https://github.com/Orbit-Cola/treehacks-2025",
    "tools": [
      "dash",
      "python",
      "pythonanywhere",
      "space-track.org",
      "sql"
    ]
  },
  {
    "name": "3Duroam",
    "link": "https://devpost.com/software/3duroam",
    "about": "Generates immersive VR experiences geared towards education. Imagine learning history as if you were living it—walking through the 1700s alongside George Washington! Picture exploring the rich culture of Korea or uncovering the hidden intricacies of farm operations. With our platform, your imagination becomes reality.\n\nBy simply entering a prompt, our advanced pipeline—powered by LangChain AI agents, NVIDIA LLMs, Perplexity search, and LumaAI—conducts in-depth research to create a detailed, engaging, and accurate learning experience. Within this immersive world, we integrate ElevenLabs' conversational AI, allowing real-time interactions with a personal AI guide, so you can ask questions and deepen your understanding.\n\nA fully personalized, interactive way to explore and learn—wherever your curiosity decides to roam!",
    "github": "https://github.com/justbustin/TreeHacks25Win",
    "tools": [
      "c#",
      "cuda",
      "elevenlabs",
      "firebase",
      "langchain",
      "lumaai",
      "metaquest",
      "nvidia",
      "perplexity",
      "python",
      "vr"
    ]
  },
  {
    "name": "Operator Optimization",
    "link": "https://devpost.com/software/operator-optimization",
    "about": "The Liquid AI project, part of TreeHacks challenges, focuses on deploying AI models on edge devices like smartphones. Challenge 1 asks participants to build demos using frameworks like `llama.cpp` with models such as Llama 3, Sana, StripedHyenna, DeepSeek R1-Distill, WhisperX, and Evo. Challenge 2 centers on optimizing core computational primitives using `Executorch` and custom operators on Samsung Galaxy S24 Ultra phones, prioritizing numerical accuracy.  Linux and MacOS are supported, and participants will optimize operators for efficient execution on the target devices.",
    "github": "https://github.com/kaloca/liquid_treehacks_challenge",
    "tools": [
      "c++",
      "executorch",
      "python",
      "pytorch"
    ]
  },
  {
    "name": "Wander",
    "link": "https://devpost.com/software/forgetable",
    "about": "The Wander Bracelet is a cutting-edge cyber-physical system designed to enhance the safety and well-being of individuals with dementia while providing peace of mind to their caregivers. This innovative device offers a suite of powerful features: it tracks the wearer’s GPS location in real-time, monitors their movements, and alerts caregivers instantly if the wearer leaves a designated safe area, such as their home. Leveraging advanced AI technology, the bracelet can gently guide wearers back home by creating personalized audio messages—based on 1-minute recordings by a familiar voice—to help reorient them.\n\nThe Wander Bracelet also integrates seamlessly with SMS, enabling caregivers to receive location updates, activity reports, and notifications without needing to download additional apps. For added safety, the bracelet is equipped with lights and vibration motors to alert both the wearer and those nearby in case of wandering incidents. Additionally, the SMS text agent provides caregivers with access to advanced analytics, offering valuable insights into the wearer’s patterns and behaviors.\n\nWith its combination of real-time tracking, AI-driven guidance, and user-friendly communication tools, the Wander Bracelet empowers caregivers to provide compassionate care while ensuring the safety and independence of their loved ones.",
    "github": "https://github.com/JonesMays/wander",
    "tools": [
      "arduino",
      "elevenlabs",
      "esp32",
      "firebase",
      "mqtt",
      "openai",
      "python",
      "twilio"
    ]
  },
  {
    "name": "AutoLeARn: AR + AI-Based Learning for Personal Car Repairs",
    "link": "https://devpost.com/software/autolearn-ar-ai-based-learning-for-personal-car-repairs",
    "about": "AutoLeARn is an interactive AR learning platform designed to address the frustration of unexpected and costly car repair bills. Leveraging augmented reality and a large language model, the project anticipates a future where AR devices become commonplace. AutoLeARn guides users through essential maintenance tasks like oil changes and brake replacements by overlaying visual instructions onto the car using speech commands and hand gestures. The goal is to empower car owners with accessible, step-by-step guidance, ultimately reducing unnecessary spending and promoting vehicle longevity.",
    "github": "https://github.com/zaid-ahmed1/AutoLeARn",
    "tools": [
      "ar",
      "c#",
      "education",
      "ffmpeg",
      "flask",
      "groq",
      "langchain",
      "llm",
      "perplexity",
      "python",
      "quest",
      "unity",
      "vlm",
      "vr",
      "whisper",
      "xr"
    ]
  },
  {
    "name": "Poof!",
    "link": "https://devpost.com/software/poof-3qshno",
    "about": "Our platform lets you search for equivalent courses and compare schools—all in one place. Simply input a course from your home school, select your desired exchange school, and instantly see relevant course matches. Plus, you can bookmark courses to compare entire schools and find the best fit for you! After you select a few courses that interest you, Poof can help you decide on a final course load, simplifying the painstakingly difficult process of ensuring that the courses are right for you.",
    "github": "https://github.com/tongliu999/TreeHacks",
    "tools": [
      "flask",
      "perplexity",
      "react"
    ]
  },
  {
    "name": "Rebase",
    "link": "https://devpost.com/software/rebase",
    "about": "Rebase is an AI-powered code analytics tool that helps developers quickly understand large codebases. It features:",
    "github": "https://github.com/evnkim/treehacks2025",
    "tools": [
      "flask",
      "openai",
      "postgresql",
      "react",
      "windsurf"
    ]
  },
  {
    "name": "EmberScout: Autonomous Rescue for when Humans can't",
    "link": "https://devpost.com/software/quakescout-the-ai-pathfinder-for-saving-lives-in-the-rubble",
    "about": "This project provides a simplified demo for running a NanoOwl application on a Jetson device.  Users SSH into the Jetson at 10.19.176.210 and navigate to the `jetson-containers` directory. The primary action involves running a Docker container containing the `tree_demo16.py` script, utilizing the camera and a specific image resolution (640x480).  Proper detachment from the container is achieved with `ctrl p ctrl q`. The Docker image is automatically tagged and run using `jetson-containers run`.",
    "github": "https://github.com/josiexw/treehacks25",
    "tools": [
      "arduino",
      "c++",
      "esp",
      "jetson-nano",
      "next.js",
      "nvidia",
      "openai",
      "perplexity",
      "python",
      "v0",
      "vercel",
      "vlm"
    ]
  },
  {
    "name": "ZoomPulse",
    "link": "https://devpost.com/software/convocriticpoopify",
    "about": "Once ZoomPulse is running in the background, hosts can run and record their Zoom meetings. After the recording is complete and the host has finished the meeting, ZoomPulse quickly generates the average sentiment of the participants and display it onto the website. ZoomPulse's approach to determining the sentiment involves taking snapshots of the Zoom recording, analyzing each frame for emotions, and taking aggregates of the sentiment to determine overall meeting satisfaction.",
    "github": "https://github.com/alanliu2009/treehack25",
    "tools": [
      "flask",
      "python",
      "react",
      "zoomapi"
    ]
  },
  {
    "name": "EarlyBird",
    "link": "https://devpost.com/software/early-bird-ujiqvh",
    "about": "Early Bird is a dynamic podcast generator built with Next.js and ShadCN for the frontend and Flask for the backend, leveraging LangChain for automation. It creates personalized podcasts by initially scraping current events using Perplexity Sonar based on user interests.  A ChatGPT agent then parses and categorizes the headlines, followed by deeper research via another Perplexity Sonar agent.  Two ChatGPT agents collaborate to generate a podcast outline and script, utilizing Mistral agents for script creation.  Finally, ElevenLabs performs text-to-speech, and a unique 3D embedding space allows users to dynamically explore and refine their interests, offering real-time interaction and a responsive, immersive experience.",
    "github": "https://github.com/roshanbellary/EarlyBird",
    "tools": [
      "11labs",
      "chatgpt",
      "flask",
      "mistral",
      "nextjs",
      "perplexity",
      "shadcn"
    ]
  },
  {
    "name": "SimuCHATlator",
    "link": "https://devpost.com/software/simu-chat-lator",
    "about": "our one-click no-code button exports your entire iMessage chatlog into our fine-tuning pipeline, turning that LLM into someone that texts exactly like your best friend, boss, partner or romantic interest.\n\nrehearse infinite messages in a sandbox, add some context and what you hope to achieve with this individual, whether personal or professional. get your drafted messages scored in real-time, before you hit the 'send' button -- suggesting edits like “add an emoji here—they respond 73% better to the sobbing emoji in awkward situations” or “shorten this paragraph—they usually disengage after 2 sentences.”\n\nnot sure how to respond to their latest text? get suggested messages powered by the same monte carlo algorithm that powered alphago.",
    "github": "https://github.com/lamboenthusiast/sim",
    "tools": [
      "carlo",
      "fastapi",
      "headless",
      "monte",
      "next.js/ts",
      "ollama",
      "python",
      "sqlite",
      "tailwind",
      "uvicorn"
    ]
  },
  {
    "name": "VoteSmart",
    "link": "https://devpost.com/software/votesmart-548672",
    "about": "VoteSmart is an AI companion built to understand a user’s political leanings and assist in the voting process. Our mission is to increase voter awareness with a transparent and comprehensive AI that eliminates the verbose terminology often found in a Voter Handbook. By leveraging AI to cultivate a culture of deeper engagement in the democratic process, we aim to empower voters with greater autonomy while restoring trust among those disillusioned by an often needlessly complex voting system.\n\nOnce their profile is saved with their political preferences, a user can immediately view their customized ballot, featuring propositions relevant to their city. Most importantly, artificial intelligence tailors ballot measure descriptions to their political leanings, offering a straightforward Yes or No voting recommendation. No more falling prey to circular language, dense jargon, or skipping votes out of frustration. VoteSmart encourages participation while giving users the autonomy to learn more about what their vote really means.",
    "github": "https://github.com/yaycobparker/VoteSmart.git",
    "tools": [
      "babel",
      "codeium",
      "css",
      "depolarizinggpt",
      "flask",
      "html",
      "javascript",
      "nltk",
      "openai",
      "python",
      "windsurf"
    ]
  },
  {
    "name": "SocratesAI",
    "link": "https://devpost.com/software/socrates-ai",
    "about": "SocratesAI is an AI agent that actively listens to conversations during Zoom meetings, continuously fact-checking statements by searching the web in real time. It not only verifies the reliability of spoken information but also enriches discussions with relevant insights and supporting data.\n\nAt the end of each call, it provides a summary report with key insights, flagged inaccuracies, and recommendations for deeper exploration.",
    "github": "https://github.com/AshwathKarunakaram/treehacks25",
    "tools": [
      "amazon-s3-bucket",
      "amazon-web-services",
      "chatgpt",
      "elevenlab",
      "fastapi",
      "javascript",
      "langchain",
      "nextjs",
      "openai",
      "perplexity",
      "pydantic",
      "python",
      "realtimemediastream",
      "server-sent-event",
      "tail-wind",
      "uvicorn",
      "websockets",
      "zoom"
    ]
  },
  {
    "name": "The Cat",
    "link": "https://devpost.com/software/the-cat-ek4py5",
    "about": "This 8 jointed cat has the dexterity of well... a cat. This means that no matter what kinds of debris, rubble, or housing, The Cat can overcome.\n\nWith this ability, it runs around burning houses in search for people. After finding them, it sends a summarized report to emergency services on them including their age and medical health so first responders can act more efficiently.\n\nIt also has a swinging tail to be more visible in fires, a flashlight to improve the quality of reports it creates through smoke, and a gimbal for a head to stabilize it's camera no matter how much damage it takes.\n\nIt can also converse with people with low latency, giving them instructions like creating a damp rag.\n\nOn top of this, it is able to use the internet to search for streets to find the nearest fire hydrants so fire fighters know exactly where to go.",
    "github": "https://github.com/bulletchicken/ILOVETREEHACKSSS",
    "tools": [
      "arduino",
      "elevenlabs",
      "erasers",
      "glue",
      "openai",
      "python",
      "sticks",
      "yolo"
    ]
  },
  {
    "name": "Flow~State",
    "link": "https://devpost.com/software/flow-state-1s5qxk",
    "about": "Flow~State is a personalized wellness platform that helps users improve their health and manage stress through tailored recommendations.",
    "github": "https://github.com/YGao2005/treehacks/",
    "tools": [
      "flask",
      "gemini",
      "pandas",
      "perplexity",
      "python",
      "pytorch",
      "swiftui",
      "terraapi"
    ]
  },
  {
    "name": "Klaw",
    "link": "https://devpost.com/software/klaw",
    "about": "Klaw enables seamless laptop control through hand gestures, facial expressions, and voice recognition, allowing users to navigate without a keyboard or mouse. It specifically supports features like gesture-based clicking, head-tilt volume control, and real-time speech-to-text captions, making technology more accessible and intuitive for users with mobility and speech impairments.",
    "github": "https://github.com/NikhilSura04/KlawTreeHacks2025",
    "tools": [
      "mediapipe",
      "numpy",
      "opencv",
      "pygame",
      "python",
      "speechrecognition"
    ]
  },
  {
    "name": "terra",
    "link": "https://devpost.com/software/terra-3kl0mg",
    "about": "Terra is a Chrome extension that:",
    "github": "https://github.com/yuyangp16/terra-chrome-extension.git",
    "tools": [
      "chrome",
      "css",
      "google",
      "html",
      "javascript",
      "json",
      "openai"
    ]
  },
  {
    "name": "Fhirband",
    "link": "https://devpost.com/software/fhirband",
    "about": "Fhirband is an AI-powered wearable designed for first responders, providing:",
    "github": "https://github.com/medibound/medibound-mobile/tree/flutterflow",
    "tools": [
      "ai",
      "ble",
      "edge-computing",
      "ehr",
      "fhir",
      "flutterflow",
      "gemini",
      "generativeai",
      "hardware",
      "healthcare",
      "iomt",
      "medtech",
      "nfc",
      "raspberrypi",
      "react",
      "sensors",
      "software",
      "spreadsheet",
      "ux",
      "wearable"
    ]
  },
  {
    "name": "Pet Talks",
    "link": "https://devpost.com/software/pet-talks",
    "about": "Introducing Pet Talks, a pet cam that allows you to have conversations with your pet by detecting gestures, movements, and even sounds. Pet Talks can also detect unusual behavior or gestures that can quickly detect medical problems.GI stasis is a common and potentially fatal condition affecting thousands of rabbits daily. Detecting its early signs can be challenging, as changes in their behavior and eating habits often go unnoticed when they're out of sight. \"Pet Talks – Because every hop, twitch, and nibble has a story to tell!\"",
    "github": "https://github.com/joshua-linsanity/pet-talk",
    "tools": [
      "openai",
      "perplexity",
      "python"
    ]
  },
  {
    "name": "Meredith",
    "link": "https://devpost.com/software/meredith",
    "about": "Meredith serves as an intelligent companion for medical residents, accessible through voice commands on their Apple Watch. It streamlines daily tasks by managing schedules, facilitating communication, retrieving patient information, and researching internet sources--all while maintaining strict medical privacy standards. The core functionality includes smart scheduling, automated documentation in standard medical formats (SBAR, admission notes, procedure notes, discharge summaries), instant access to up-to-date medical research, and intelligent task management that adapts to the dynamic nature of hospital work.",
    "github": "https://github.com/xzrderek/treehacks25/",
    "tools": [
      "flask",
      "ios",
      "llama-3.3",
      "next.js",
      "perplexity-sonar",
      "python",
      "swift",
      "typescript",
      "xcode"
    ]
  },
  {
    "name": "CHRONOS - Satellite Powered Disaster Response",
    "link": "https://devpost.com/software/chronos-satellite-powered-disaster-response",
    "about": "CHRONOS is a satellite-powered disaster response application designed to support first responders in quickly responding to natural disasters. By analyzing high-resolution satellite imagery, CHRONOS uses a classical ML method of change detection models (PCA & K-means) to rapidly identify land areas affected by wildfires, flooding, earthquakes, and other climate events.\n\nWhen a significant change is detected (enough pixels are found to have changed in the image), a Vision Language Model (VLM) is used to perform inference and generate a caption describing the event. This caption is then fed into Perplexity's Sonar API to provide first responders with further information about the area and affected regions, such as the type of disaster, its location, and potential impact. For instance, during the recent Los Angeles wildfires, CHRONOS could have quickly identified the affected areas and provided first responders with critical information about the fire's progression. Finally, first responders can receive instant notifications for critical events affecting emergency operations during natural disasters via the CHRONOS mobile app.",
    "github": "https://github.com/gkim65/CHRONOS",
    "tools": [
      "bilp",
      "planetlabs",
      "python",
      "pytorch",
      "vlm"
    ]
  },
  {
    "name": "Aegis Command",
    "link": "https://devpost.com/software/aegis-command",
    "about": "Aegis Command is a real-time AI-powered military operations dashboard that:",
    "github": "https://github.com/shaashvat01/tree",
    "tools": [
      "express.js",
      "lucid",
      "next.js",
      "node.js",
      "openai",
      "perplexity",
      "recharts",
      "shadcn",
      "tailwind",
      "terra",
      "typescript",
      "vercel",
      "websockets"
    ]
  },
  {
    "name": "ConnectHer",
    "link": "https://devpost.com/software/connecther-3bnhze",
    "about": "ConnectHer helps women find mentors, connect with peers, join communities, and access valuable resources for personal and professional growth. Users can match with mentors, discover like-minded peers, share experiences, and build lasting support networks.",
    "github": "https://github.com/aayahosman/TreeHacks-Project.git",
    "tools": [
      "css",
      "html",
      "javascript",
      "mongodb",
      "next.js",
      "node.js",
      "postman",
      "react",
      "zoomapi"
    ]
  },
  {
    "name": "Campus Food Truck",
    "link": "https://devpost.com/software/campus-food-truck",
    "about": "Our iOS app allows food truck owners to update their live location, making it easy for students to find them on an interactive map. Users can search for nearby food trucks, view their menus, and get notified when their favorite trucks are close by. This improves visibility for food truck owners while enhancing convenience for students.",
    "github": "https://github.com/chenxyuhua/campus-foodtruck-finder",
    "tools": [
      "ios",
      "swift"
    ]
  },
  {
    "name": "Super Smash",
    "link": "https://devpost.com/software/super-smash-pixel-edition",
    "about": "Basically just a reimplementation of the game, that can be played in multiple ways depending on how comfortable you feel using your hands. We have different control layouts for disabilities, and also have reaction timing so you can tell if you're healing from arm injuries.",
    "github": null,
    "tools": [
      "java"
    ]
  },
  {
    "name": "hydRation",
    "link": "https://devpost.com/software/hydration-cr0f4m",
    "about": "Our app helps users monitor their hydration levels in real-time using just their phone’s camera. By analyzing a short video of their fingers, the app extracts a PPG signal (photoplethysmogram), which reflects changes in blood volume that are influenced by hydration status.\n\nThe process is simple:",
    "github": "https://github.com/janetguo/HydRation",
    "tools": [
      "firebase",
      "flutterflow",
      "numpy",
      "opencv",
      "python",
      "scipy",
      "terra"
    ]
  },
  {
    "name": "Omnis",
    "link": "https://devpost.com/software/omnis-gb4zfj",
    "about": "Our tool allows you to keep everything in one place and also uses LLMs to parse this information so you can actually interact with it! Omnis allows students to upload lecture slides, notes, videos, and homework into a single system where they can chat with an AI assistant trained on their own materials. Users can ask questions, get clarifications, and explore concepts with references directly from their coursework, creating a personalized and centralized learning experience.",
    "github": "https://github.com/adityatadimeti/omnis",
    "tools": [
      "firebase",
      "iris",
      "javascript",
      "openai",
      "python",
      "react"
    ]
  },
  {
    "name": "Ruminate",
    "link": "https://devpost.com/software/ruminate-t764yw",
    "about": "Ruminate is an AI-powered reading companion that analyzes PDFs in real-time, providing block-by-block explanations and interactive annotations. Built with Next.js, FastAPI, and utilizing OpenAI and Gemini APIs, it detects and processes content, handling complex elements like LaTeX equations and tables. The application maintains conversation context and offers progress visualization.  Key features include adaptive analysis based on learning objectives, real-time processing, and a persistent chat interface.  It's designed for efficient understanding of technical documents, leveraging caching and server-sent events for a responsive user experience.",
    "github": "https://github.com/vivekvajipey/treehacks-2025",
    "tools": [
      "asyncio",
      "fastapi",
      "gemini",
      "gpt-4o",
      "marker",
      "mathjax",
      "nextjs",
      "postgresql",
      "python"
    ]
  },
  {
    "name": "Buzzy",
    "link": "https://devpost.com/software/buzzy-in8s35",
    "about": "Buzzy is an AI-powered study planner that dynamically generates personalized, research-backed study schedules. It seamlessly integrates with Google Calendar, analyzes coursework materials (syllabus, exams, problem sets), and tailors study plans based on both general coursework and specific weak areas.\n\nBy aligning study sessions with scientific techniques like spaced repetition and active recall, Buzzy helps students retain information more effectively. With adaptive scheduling and a stress-free planning experience, students can focus on what matters: actually learning.",
    "github": null,
    "tools": [
      "figma",
      "flutterflow"
    ]
  },
  {
    "name": "FitStreak",
    "link": "https://devpost.com/software/name-iskuvt",
    "about": "FitStreak is a comprehensive fitness tracking and motivation platform that:\n\nConnects with wearable devices to track daily activities, sleep patterns, and body composition Uses AI to analyze fitness data and provide personalized insights and recommendations Implements a streak-based motivation system that encourages daily goal completion Tracks multiple fitness metrics including distance, time, and calories burned Provides detailed analysis of sleep patterns and body composition Offers a clean, modern interface for goal setting and progress monitoring",
    "github": "https://github.com/leojia22/Treehacks25.git",
    "tools": [
      "firebase",
      "flask",
      "flask-cors",
      "openai",
      "python",
      "react",
      "terraapi"
    ]
  },
  {
    "name": "Dashify",
    "link": "https://devpost.com/software/dashify",
    "about": "Dashify transforms a Google Sheet into an interactive, customizable dashboard. Users provide a link to their sheet and the tool:",
    "github": "https://github.com/halliefaust/sheet2dash",
    "tools": [
      "flask",
      "google-sheets-api",
      "next.js",
      "openai",
      "recharts",
      "shadcn",
      "tailwind",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "gitRizz.ai",
    "link": "https://devpost.com/software/gitrizz-ai",
    "about": "gitRizz.ai is a Hinge-style matchmaking platform that curates GitHub profiles to find the most optimal matches - all you have to do is login with Github! We generate vector scores for each user, combining numerical metrics (commits, contributions, PRs) with contextual analysis (commit messages, READMEs, bios, profiles) to get a well-rounded view of their personality from both their technical contributions and textual expressions of themselves. Using vector search, we calculate similarity scores between users, ensuring meaningful connections. Lastly, we used OpenAI to generate personalized feedback for each profile since a lot of these Github profiles can have a lot of information all at once. If two users mutually swipe right, they can chat and collaborate—professionally or romantically!",
    "github": "https://github.com/aliceli465/treehacks25",
    "tools": [
      "beautiful-soup",
      "elasticsearch",
      "flask",
      "github",
      "kibana",
      "lucide",
      "node.js",
      "openai",
      "python"
    ]
  },
  {
    "name": "Kaleidoscope",
    "link": "https://devpost.com/software/kaleidoscope-ewg9rc",
    "about": "Instead of spending many weeks/months and hundreds of thousands of dollars testing different ads and messaging on real customers, use Kaleidoscope’s simulated customers instead. By comparing your existing customer tracking data (from Google Analytics, Shopify, Stripe) and your historical customer interactions (social media posts, TV ads, news articles, customer support calls, product reviews), my product learns how different segments of customers have historically responded to specific messaging and content. Given your business goals, it then creates swaths of AI agents and conducts controlled trials with them to find the most effective way for you to message your audience. Even household name brands find themselves short on marketing research spend and make disastrous PR blunders. Kaleidoscope catches them before the wrong person notices.",
    "github": null,
    "tools": [
      "amazon-rds-relational-database-service",
      "nextjs",
      "openai",
      "prisma"
    ]
  },
  {
    "name": "LinguaVista - Language & Cultural Learning Platform",
    "link": "https://devpost.com/software/linguavista-language-cultural-learning-platform",
    "about": "LinguaVista is an AI-powered language and cultural learning platform developed during TreeHacks 2025. It utilizes immersive visual learning to allow users to “see, speak, and connect” with people globally. Created by Henry Shires, Brayton Lordianto, Raina Song, and Abhushan Pradhan, the project focuses on an engaging and interactive learning experience through visual content and AI technology.",
    "github": "https://github.com/hcshires/LinguaVista",
    "tools": [
      "coquitts",
      "electron",
      "express.js",
      "insanely-fast-whisper",
      "llama3",
      "ollama",
      "python",
      "react",
      "stablediffusion3",
      "typescript",
      "zoomrtms"
    ]
  },
  {
    "name": "Matcha Vibe",
    "link": "https://devpost.com/software/matchavibe",
    "about": "Real-Time Speech & Gesture Analysis – The AI detects sentiment, engagement levels, and facial expressions to understand participant reactions.\nPersonalized AI Presence – The avatar adapts dynamically depending on the meeting flow from analytics.\nFrom Mindfulness to Business Pitches – Whether it's a tea ceremony to guide relaxation or an AI-driven sales coach assessing audience attention, this system is open for personalized interactions for any situation.\n\nBy integrating AI-driven adaptability, MatchaVibe transforms how we engage in virtual meetings, making online collaboration more immersive and impactful.",
    "github": "https://github.com/treehacks2025/mockRTMSserver",
    "tools": [
      "docker",
      "elevenlabs",
      "gemini",
      "groq",
      "javascript",
      "luma",
      "lumaai",
      "node.js",
      "websockets",
      "whisper",
      "zoom",
      "zoom-api"
    ]
  },
  {
    "name": "Anim-Education",
    "link": "https://devpost.com/software/immersive-ed",
    "about": "We developed an application that enhances lecture comprehension by generating real-time animations that visually reinforce the professor’s words. Unlike static slides, which can sometimes feel disengaging or overwhelming, our dynamic visuals provide an interactive and intuitive way to grasp complex concepts. By bridging the gap between auditory learning and visual understanding, our tool helps students stay focused, absorb information more effectively, and retain key concepts with greater clarity.",
    "github": "https://github.com/msteele3/treehacksdockerdeploy",
    "tools": [
      "c#",
      "docker",
      "fastapi",
      "groq",
      "manim",
      "openai",
      "python",
      "unity"
    ]
  },
  {
    "name": "Verifact",
    "link": "https://devpost.com/software/verifact",
    "about": "Verifact is an AI-powered claim verification service that automatically identifies and verifies factual statements in real-time. Users can input any text, and our system:",
    "github": null,
    "tools": [
      "next.js-15",
      "openai",
      "perplexity",
      "radix-ui",
      "react-query",
      "tailwind-css",
      "typescript"
    ]
  },
  {
    "name": "Wellness Dorm",
    "link": "https://devpost.com/software/wellness-dorm",
    "about": "The app incorporates a chatbot that answers questions and a UI built using Vercel, with our edits. We attempted to use Dain's Butterfly to build a wellness tool, but struggled to get it to work, though we worked somewhat with the code. We also hope to add a larger database using ChromaDB and integrate data from an app like Terra. Hopefully, we'll get it working in the future!",
    "github": "https://github.com/mihir-putcha/treehacks2025",
    "tools": [
      "chroma",
      "javascript",
      "open-ai",
      "vercel"
    ]
  },
  {
    "name": "Tower-bot: Towers of Hanoi Solver",
    "link": "https://devpost.com/software/tower-bot-towers-of-hanoi-solver",
    "about": "Towerbot attempts to solve the Tower of Hanoi problem by perceiving the environment with RGB-D cameras, identifying the disks, and executing planned motions to move the disks between rods. The system uses an antipodal grasping strategy to pick up the disks and a motion planner to ensure smooth, collision-free movements.",
    "github": "https://github.com/ishitag925/towerbot.git",
    "tools": [
      "drake",
      "meshcat",
      "python"
    ]
  },
  {
    "name": "Lentil",
    "link": "https://devpost.com/software/lentil",
    "about": "Lentil is an AI-powered compiler feedback assistant. To use it, you’ll need OCaml, Dune, and uv installed. The project includes a command-line interface (CLI) that allows you to integrate Lentil into your compilation workflow. Launch the webserver using the CLI and then run your compilation command with `lenstil --`. Lentil analyzes the compilation output and provides feedback, streamlining the development process.",
    "github": "https://github.com/plamorg/lentil",
    "tools": [
      "chromadb",
      "llm",
      "ocaml",
      "openai",
      "python",
      "react",
      "typescript"
    ]
  },
  {
    "name": "calvin",
    "link": "https://devpost.com/software/calvin-3jpoqh",
    "about": "to preface, canvas is a learning management system (lms) that is used by many schools including stanford, and you can imagine this application as an add-on to the lms. calvin is your personal chatbot when it comes to canvas courses and assignments. select a school subject then click on an assignment. you can, then, ask calvin about your assignment. also, you can even ask the chatbot about all your classes. you don't have to specify which assignment. you can even whiteboard out your query if you feel like it.",
    "github": "https://github.com/flotoria/treehacks25",
    "tools": [
      "chroma",
      "groq",
      "instructure-canvas",
      "langchain",
      "langgraph",
      "python",
      "typescript"
    ]
  },
  {
    "name": "Echo",
    "link": "https://devpost.com/software/echo-q58c7p",
    "about": "Echo takes any epub or PDF, cleans up any artifacts like footers/headers/page numbers, and turns it into an high quality audiobook within minutes - so you can listen to the latest research paper on your commute.\n\nBeyond this, you can TALK to Echo audiobooks. If you have a question about some confusing content, want to dive deeper into a concept, or even just define a word, you can ask Echo, which will respond with context from what you've been listening to :)",
    "github": "https://github.com/685Degrees/echo-reader",
    "tools": [
      "elevenlabs",
      "gemini",
      "mistral",
      "next.js",
      "openai",
      "react",
      "realtimeapi",
      "tailwind"
    ]
  },
  {
    "name": "XrayVision",
    "link": "https://devpost.com/software/xrayvision-dgblcq",
    "about": "XrayVision is a web app that empowers patients by providing instant diagnostic insights from multiple AI models. By leveraging an ecosystem of diverse AI models, we ensure greater trust, reduced uncertainty, and more reliable results compared to a single-model approach. Our platform not only detects diseases and pathologies but also offers AI-driven explanations, generates comprehensive reports, and provides personalized recommendations for next steps. It’s designed to be a supportive tool for gaining feedback or a second opinion.",
    "github": "https://github.com/loufay/XrayVision",
    "tools": [
      "api",
      "app",
      "chexagent",
      "chexpert",
      "edge-ai",
      "foundational-models",
      "llms",
      "medimageinsight",
      "mimic",
      "mistral",
      "perplexity",
      "python",
      "vlm"
    ]
  },
  {
    "name": "Sign-Speak: No voice unheard",
    "link": "https://devpost.com/software/sign-sight-no-voice-unheard",
    "about": "Sign-Speak is a pair of smartglasses that allow deaf users to translate their ASL signs into spoken audio in real-time.\n\nMost existing solutions focus on translation from the reader's perspective, and to our knowledge there isn't anyone working on translating ASL from the signer's perspective. Evidence for this is the lack of labelled data for back-of-hand ASL signs, which is a challenge that we overcame early in the project (see \"Challenges we ran into\").\n\nBuilt with MediaPipe's hand-tracking neural network and hosted on NVIDIA's Jetson Nano, the glasses extract precise hand landmarks, process them through a custom neural network trained on our custom ASL dataset focused only on backside hand movements, and deliver instant voice translations via an attached speaker. Our CV and speech-to-text models are hosted completely on device, making Sign-Speak a true Edge AI product pushing the frontiers of accessibility tech.\n\nOur goal is to empower the deaf community to communicate freely and create a world where every conversation transcends the barriers of sound.",
    "github": "https://github.com/vkodithala/sign-speak",
    "tools": [
      "3d",
      "cad",
      "cuda",
      "jetson-nano",
      "mediapipe",
      "numpy",
      "opencv",
      "python",
      "tensorflow"
    ]
  },
  {
    "name": "PrescribatronJelqinator",
    "link": "https://devpost.com/software/prescribatronjelqinator",
    "about": "PrescribatronJelqinator is a secure, AI-powered medical assistant that allows doctors to:\n✅ Instantly retrieve patient data from encrypted hospital records.\n✅ Ask context-aware questions (e.g., \"Does this patient have a history of anemia?\").\n✅ Run locally for privacy while maintaining HIPAA compliance.\n✅ Summarize clinical notes and cross-reference medical history in real time.\n\nInstead of sifting through records manually, a doctor can simply ask and get an accurate, contextual response based on the patient's real medical history.",
    "github": "https://github.com/davidmaemoto/prescribatronjelqinator",
    "tools": [
      "json"
    ]
  },
  {
    "name": "TrivAI",
    "link": "https://devpost.com/software/trivai-vle72m",
    "about": "TrivAI is an interactive multiplayer trivia game that uses AI to generate unique questions based on player-chosen topics. Key features include:",
    "github": "https://github.com/kavelrao/TrivAI",
    "tools": [
      "nextjs",
      "openai",
      "pusher",
      "typescript"
    ]
  },
  {
    "name": "ClassPulse",
    "link": "https://devpost.com/software/classpulse",
    "about": "ClassPulse is an AI-powered assistant for professors that helps them better understand their students through two key approaches:",
    "github": "https://github.com/speedstorm1/treehacks25",
    "tools": [
      "gemini",
      "next",
      "openai",
      "python"
    ]
  },
  {
    "name": "Eigensurance: AI x Web3",
    "link": "https://devpost.com/software/lalala-vqp6xg",
    "about": "Eigensurance is a decentralized disaster insurance protocol built on EigenLayer, utilizing multiple operator validation for disaster event verification and claims processing. This prototype, developed using Node.js and Foundry, simulates a policy creation (1 ETH coverage, San Francisco, earthquake) and disaster event (7.0 earthquake) for testing purposes. The project includes components like a DisasterInsuranceServiceManager and a MockDisasterOracle. Local development involves deploying core and insurance contracts via npm scripts. Testing covers policy creation, simulation, validation, and claims processing. Due to its prototype nature, it’s not intended for production use.",
    "github": "https://github.com/andrewgcodes/eigen",
    "tools": [
      "eigenlayer",
      "eth",
      "evm",
      "openai",
      "perplexity",
      "python",
      "solidity",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "PrepTracker",
    "link": "https://devpost.com/software/preptracker",
    "about": "PrepTracker allows students to set daily, weekly, and one-time study goals, track progress via a heatmap dashboard, and receive AI-generated motivational reminders via email. The tool helps students stay on top of their goals, providing a visual representation of their achievements and keeping them engaged throughout their study process.",
    "github": "https://github.com/alaminShaheen/PrepTracker",
    "tools": [
      "express.js",
      "firebase",
      "next.js",
      "node.js",
      "react.js",
      "tailwind"
    ]
  },
  {
    "name": "EasyRead",
    "link": "https://devpost.com/software/easyread-5axzc3",
    "about": "EasyRead makes reading easier by allowing users to double-click on complex words to see a simpler version. If they want to revert, a single click brings back the original word. Additionally, it builds a personal dictionary of all clicked words, helping users track and learn new vocabulary effortlessly.",
    "github": "https://github.com/ym256-stanford/tree-hacks-2025.git",
    "tools": [
      "css",
      "dictionaryapi",
      "figma",
      "html",
      "node.js",
      "openai",
      "react",
      "wireframing"
    ]
  },
  {
    "name": "xxx",
    "link": "https://devpost.com/software/xxx-lrki7u",
    "about": "ZU-LM is a research-driven podcast generator utilizing multiple AI services. To operate, you’ll need to set up an environment with API keys for ElevenLabs (text-to-speech), Groq (LLM inference), OpenAI, Luma AI (image generation), and Perplexity (search).  The project consists of a Rust backend and a JavaScript frontend.  You'll configure variables like local LLM and research depth. Running the project involves installing dependencies and starting both the frontend (npm run dev) and backend (cargo run) services.  The core functionality generates engaging conversations based on chosen topics, leveraging AI for both speech and research.",
    "github": "https://github.com/zcsabbagh/zu-lm",
    "tools": [
      "elevenlabs",
      "groq",
      "javascript",
      "langchain",
      "lumalabs",
      "mistral",
      "openai",
      "perplexity",
      "rust",
      "typescript"
    ]
  },
  {
    "name": "Slumber Synthesizer",
    "link": "https://devpost.com/software/slumber-synthesizer",
    "about": "Slumber Synthesizer is a modern web application designed for recording, analyzing, and sharing dreams using AI. Users can record dreams with descriptions, categorize them, and add emotional context, with AI generating associated imagery and interpretations. The platform boasts community features for sharing and browsing dreams, alongside analytics tracking dream patterns and emotional trends. Built with React, TypeScript, and Supabase, it integrates with OpenAI’s DALL-E 3 and Mistral AI. The application allows users to track dream frequency and explore visual statistics, offering a comprehensive dream journaling experience.",
    "github": "https://github.com/MiPlayer123/slumber-synthesizer",
    "tools": [
      "dall-e",
      "mistral",
      "openai",
      "perplexity",
      "react",
      "supabase",
      "typescript",
      "vite"
    ]
  },
  {
    "name": "Nirmaan",
    "link": "https://devpost.com/software/nirmaan",
    "about": "Nirmaan is a blockchain and AI-powered platform that ensures fair wages, secure payments, and labor welfare for construction workers in developing and diverse economies like India.",
    "github": "https://github.com/samarthchandrawat/nirmaan_v1",
    "tools": [
      "next.js",
      "openai",
      "postgresql",
      "solidity",
      "tailwindcss",
      "typescript"
    ]
  },
  {
    "name": "excelerator",
    "link": "https://devpost.com/software/excelerator",
    "about": "Excelerator is an Excel add-in that enables users to:",
    "github": null,
    "tools": [
      "actions",
      "add-ins",
      "amazon-web-services",
      "api",
      "autosklearn",
      "azure",
      "blob",
      "colab",
      "css",
      "docker",
      "excel",
      "fastapi",
      "functions",
      "github",
      "google",
      "graph",
      "h2o.ai",
      "html",
      "javascript",
      "keras",
      "lambda",
      "microsoft",
      "numpy",
      "office",
      "optuna",
      "pandas",
      "postgresql",
      "python",
      "s3",
      "scikit-learn",
      "sqlite",
      "storage",
      "tensorflow",
      "typescript",
      "vercel"
    ]
  },
  {
    "name": "HackTCHA",
    "link": "https://devpost.com/software/hacktcha",
    "about": "HackTCHA is a project designed to test the resistance of AI models to CAPTCHA solving. It involves setting up a React frontend and a Python backend (server.py) to run tests against multiple AI models. Users clone the repository, install dependencies using `npm` and `pip`, and then run the React frontend with `npm run dev` while the Python server (`server.py`) executes tests. The application can be accessed via http://localhost:5173. The goal is to evaluate how well AI models can solve CAPTCHAs.",
    "github": "https://github.com/dubiels/treehacks2025",
    "tools": [
      "flask",
      "gemini",
      "imgur",
      "javascript",
      "jsx",
      "lucide",
      "numpy",
      "python",
      "react",
      "sqlite",
      "tailwind",
      "vite"
    ]
  },
  {
    "name": "EigenInsure",
    "link": "https://devpost.com/software/eigensurance",
    "about": "This project is a simple web application built with Flask that allows users to create, read, update, and delete (CRUD) tasks. It utilizes a SQLite database to store task data.  The application provides a basic user interface with forms for adding and managing tasks.  The README outlines the initial setup, running instructions, and a brief overview of the project’s functionality, intending to serve as a foundational example for a to-do list application.",
    "github": "https://github.com/eigeninsure",
    "tools": [
      "avs",
      "eigenlayer",
      "express.js",
      "liquidai",
      "mistral",
      "nextjs",
      "openai",
      "perplexity",
      "solidity",
      "typescript"
    ]
  },
  {
    "name": "MediaFusion",
    "link": "https://devpost.com/software/mediafusion-oml502",
    "about": "This platform utilizes advanced semantic search algorithms to analyze and retrieve relevant data from this diverse content repository. After processing the input prompt, the system performs a semantic search to fetch pertinent content, which is then used as references for the language model to enhance the accuracy and relevance of its outputs.\n\nIt leverages a multi-agent system to analyze user input and execute the appropriate agent based on the type of content or task required. The platform is designed to handle inputs across a diverse formats including images, YouTube links, and pdf files. For videos, it fetches metadata through the YouTube API, which is then effectively summarized using a LLM to provide concise and relevant content overviews. Similarly, the system is equipped to summarize content from images, ensuring a comprehensive and versatile user experience that accommodates various types of media.\n\nAdditionally, the platform incorporates the capability to generate images using the Stable Diffusion algorithm, further enriching the user interaction experience by providing visual content generation based on textual prompts. The system stores generated images in Pinata (IPFS) and also maintains a comprehensive chat history, enabling seamless continuity in interactions and the ability to reference previous conversations when needed.",
    "github": "https://github.com/Hasnain01-hub/ai_chat_assistant",
    "tools": [
      "azure",
      "langchain",
      "langgraph",
      "next.js"
    ]
  }
]